#ifndef REACHABLEAREACALCULATOR_INNER_ANGLE_H
#define REACHABLEAREACALCULATOR_INNER_ANGLE_H
//==============================================================================
namespace ReachableAreaCalculator
{
//==============================================================================
/*
* \brief Угол
*/
class Angle
{
//==============================================================================
public:
//==============================================================================
  /*
  * \brief Конструктор
  * \param[in] value - значение угла.
  */
  Angle(double value = 0);
//==============================================================================
  /*
  * \brief Конструктор копирования
  * \param[in] angle - угол.
  */
  Angle(const Angle& angle);
//==============================================================================
  /*
  * \brief Получение значения угла
  * \return значение угла.
  */
  double value() const;
//==============================================================================
  /*!
   * \brief setValue - сеттер значения угла.
   * \param[in] value - новое значение угла.
   */
  inline void setValue(double value) noexcept
  {
    *this = Angle(value);
  }
//==============================================================================
  /*
  * \brief Разность двух направлений
  * \details Возвращает наименьший по модулю угол.
  * \        Возвращаемое значение лежит в интервале (-pi, pi].
  * \param[in] angle1 - первое направление;
  * \param[in] angle2 - второе направление;
  * \return угол между направлениями.
  */
  double deltaAngle(const Angle& angle) const;
//==============================================================================
  /*
  * \brief Разность двух направлений
  * \details Возвращает значение угла, полученного при следовании от
  * \        одного направления до другого в направлении возрастания
  * \        (против часовой стрелки).
  * \        Возвращаемое значение лежит в интервале [0, 2*pi).
  * \param[in] angle1 - первое направление;
  * \param[in] angle2 - второе направление;
  * \return угол между направлениями.
  */
  double deltaAngleCounterclockwise(const Angle& angle) const;
//==============================================================================
private:
//==============================================================================
  double mValue;  // значение угла (лежит в интервале [0, 2*pi))
};
//==============================================================================
} //! ReachableAreaCalculator

#endif // REACHABLEAREACALCULATOR_INNER_ANGLE_H
