#ifndef REACHABLEAREACALCULATOR_INNER_ARCS_H
#define REACHABLEAREACALCULATOR_INNER_ARCS_H
//==============================================================================
#include <ReachableAreaCalculator.hpp>

#ifndef Q_MOC_RUN
//! Inner
#include <Inner/GeometryEnvironment.hpp>
#include <Inner/Angle.hpp>
//! PrimaryEntities
#include <PrimaryEntities/GeometryEntities.hpp>
//! std
#include <atomic>
#endif
//==============================================================================
namespace ReachableAreaCalculator
{
//==============================================================================
typedef unsigned int uinttype; //! целочисленный беззнаковый тип
//==============================================================================
/*!
 * \brief Тип границы (обрыва) дуги.
 */
enum ArcBeginEndInfo
{
  ByRefPoint = 0, //! из-за точки преломления;
  ByViewZone = 1, //! из-за ограничения зоны обзора;
  ByEdge = 2,     //! из-за границы;
  ByCut = 3       //! из-за обрезки склейщиком.
};
//==============================================================================
//==============================================================================
/*!
 * \brief Дуга.
 */
class Arc
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор.
   */
  Arc() noexcept
    : mBox(Point2D(), Point2D())
  { }
//==============================================================================
  /*!
   * \brief Конструктор.
   * \param[in] center     - центральная точка;
   * \param[in] centerId   - глобальный идентификатор центральной точки;
   * \param[in] radius     - радиус дуги;
   * \param[in] beginAngle - начальный угол;
   * \param[in] endAngle   - конечный угол.
   * \param[in] isEmpty    - параметр, говорящий о том, как интерперетировать
   *                       совпадение начального и конечного углов:
   *                       true -- размер дуги равен нулю (пустая дуга),
   *                       false -- размер дуги равен 2π (полная дуга).
   */
  Arc(
    const Point2D& center,
    uinttype centerId,
    double radius,
    const Angle& beginAngle,
    const Angle& endAngle,
    bool isEmpty = true) noexcept;
//==============================================================================
  /*!
   * \brief setId -- метод, устанавливающий новый идентификатор дуги.
   * \param[in] id -- новый идентификатор дуги.
   */
  inline void setId(const uinttype id) noexcept
  {
    mId = id;
  }
//==============================================================================
  /*!
   * \brief setBeginInfo -- метод, устанавливающий тип обрыва начала для дуги.
   * \param[in] info -- тип обрыва начала дуги.
   * \param[in] id -- уникальный идентификатор
   * начальной вершины ребра полигона окружения, которым обрывается начало дуги
   * (если оно обрывается ребром).
   */
  inline void setBeginInfo(ArcBeginEndInfo info, uinttype id = 0) noexcept
  {
    mBeginInfo = info;
    mArcBeginInfo = id;
  }
//==============================================================================
  /*!
   * \brief setEndInfo -- метод, устанавливающий тип обрыва конца для дуги.
   * \param[in] info -- тип обрыва конца дуги.
   * \param[in] id -- уникальный идентификатор
   * начальной вершины ребра полигона окружения, которым обрывается конец дуги
   * (если он обрывается ребром).
   */
  inline void setEndInfo(ArcBeginEndInfo info, uinttype id = 0) noexcept
  {
    mEndInfo = info;
    mArcEndInfo = id;
  }
//==============================================================================
  /*!
   * \brief setBeginAngle -- метод, устанавливающий начальный угол дуги.
   * \param[in] angle -- значение угла, которое требуется установить.
   * \param[in] isEmpty -- параметр, говорящий о том, как интерперетировать
   *                       совпадение начального и конечного углов:
   *                       true -- размер дуги равен нулю (пустая дуга),
   *                       false -- размер дуги равен 2π (полная дуга).
   */
  void setBeginAngle(Angle angle, bool isEmpty = true) noexcept;
//==============================================================================
  /*!
   * \brief setEndAngle -- метод, устанавливающий конечный угол дуги.
   * \param[in] angle -- значение угла, которое требуется установить.
   * \param[in] isEmpty -- параметр, говорящий о том, как интерперетировать
   *                       совпадение начального и конечного углов:
   *                       true -- размер дуги равен нулю (пустая дуга),
   *                       false -- размер дуги равен 2π (полная дуга).
   */
  void setEndAngle(Angle angle, bool isEmpty = true) noexcept;
//==============================================================================
  /*!
   * \brief setBeginEndAngles -- метод,
   * устанавливающий начальный и конечный углы дуги.
   * \param[in] beginAngle -- значение,
   * которое требуется установить в качестве начального угла.
   * \param[in] endAngle -- значение,
   * которое требуется установить в качестве конечного угла.
   * \param[in] isEmpty -- параметр, говорящий о том, как интерперетировать
   *                       совпадение начального и конечного углов:
   *                       true -- размер дуги равен нулю (пустая дуга),
   *                       false -- размер дуги равен 2π (полная дуга).
   * \details Задаётся начальный угол и пересчитывается размер дуги.
   */
  void
  setBeginEndAngles(
    Angle beginAngle,
    Angle endAngle,
    bool isEmpty = true) noexcept;
//==============================================================================
  /*!
   * \brief setTaskInfo -- метод, устанавливающий id заданий, создавшего дугу и 
   *      породившего задание, которое создало дугу.
   * \param[in] taskId -- id задания, создавшего дугу.
   * \param[in] parentTaskId -- id задания, породившего задание, создавшее дугу.
   */
  inline void setTaskInfo(uinttype taskId, uinttype parentTaskId) noexcept
  {
    mTaskId = taskId;
    mParentTaskId = parentTaskId;
  }
//==============================================================================
  /*!
   * \brief id -- метод, возвращающий идентификатор дуги.
   * \return идентификатор дуги.
   */
  inline uinttype id() const noexcept
  {
    return mId;
  }
//==============================================================================
  /*!
   * \brief center -- метод, возвращающий центральную точку дуги.
   * \return ссылка на центральную точку дуги.
   */
  inline const Point2D& center() const noexcept
  {
    return mCenter;
  }
//==============================================================================
  /*!
   * \brief centerId -- метод,
   * возвращающий идентификатор центральной точки дуги.
   * \return идентификатор центральной точки дуги.
   */
  inline uinttype centerId() const noexcept
  {
    return mCenterId;
  }
//==============================================================================
  /*!
   * \brief taskId -- метод, возвращающй id задания, создавшего дугу.
   * \return id задания, создавшего дугу.
   */
  inline uinttype taskId() const noexcept
  {
    return mTaskId;
  }
//==============================================================================
  /*!
   * \brief parentTaskId -- метод, возвращающий id задания, породившего задание, 
   * которое создало дугу.
   * \return id задания, породившего задание, которое создало дугу.
   */
  inline uinttype parentTaskId() const noexcept
  {
    return mParentTaskId;
  }
//==============================================================================
  /*!
   * \brief radius -- метод, возвращающий радиус дуги.
   * \return радиус дуги.
   */
  inline double radius() const noexcept
  {
    return mRadius;
  }
//==============================================================================
  /*!
   * \brief beginAngle -- метод, возвращающий начальный угол дуги.
   * \return начальный угол дуги.
   */
  inline Angle beginAngle() const noexcept
  {
    return mBeginAngle;
  }
//==============================================================================
  /*!
   * \brief endAngle -- метод, возвращающий конечный угол дуги.
   * \return конечный угол дуги.
   */
  inline Angle endAngle() const noexcept
  {
    return Angle(mBeginAngle.value() + mSize);
  }
//==============================================================================
  /*!
   * \brief size -- метод, возвращающий размер дуги (в радианах).
   * \return размер дуги (в радианах).
   */
  inline double size() const noexcept
  {
    return mSize;
  }
//==============================================================================
  /*!
   * \brief beginInfo -- метод, возвращающий тип обрыва начала дуги.
   * \return тип обрыва начала дуги.
   */
  inline ArcBeginEndInfo beginInfo() const noexcept
  {
    return mBeginInfo;
  }
//==============================================================================
  /*!
   * \brief endInfo -- метод, возвращающий тип обрыва конца дуги.
   * \return тип обрыва конца дуги.
   */
  inline ArcBeginEndInfo endInfo() const noexcept
  {
    return mEndInfo;
  }
//==============================================================================
  /*!
   * \brief arcBeginInfo -- метод,
   * возвращающий дополнительную информацию о начале дуги.
   * \return дополнительная информация о начале дуги.
   * \details Если начало дуги обрывается стороной полигона окружения,
   * дополнительной информацией является id начальной точки
   * этой стороны полигона.
   */
  inline uinttype arcBeginInfo() const noexcept
  {
    return mArcBeginInfo;
  }
//==============================================================================
  /*!
   * \brief arcEndInfo -- метод,
   * возвращающий дополнительную информацию о конце дуги.
   * \return дополнительная информация о конце дуги.
   * \details Если конец дуги обрывается стороной полигона окружения,
   * дополнительной информацией является id начальной точки
   * этой стороны полигона.
   */
  inline uinttype arcEndInfo() const noexcept
  {
    return mArcEndInfo;
  }
//==============================================================================
  /*!
   * \brief beginPoint -- метод, возвращающий начальную точку дуги.
   * \return начальная точка дуги.
   */
  Point2D beginPoint() const noexcept;
//==============================================================================
  /*!
   * \brief endPoint -- метод, возвращающий конечную точку дуги.
   * \return конечная точка дуги.
   */
  Point2D endPoint() const noexcept;
//==============================================================================
  /*!
   * \brief box -- получение коробки.
   * \return коробка
   */
  inline const Box2D& box() const noexcept
  {
    return mBox;
  }
//==============================================================================
  /*!
   * \brief isPointInSector -- метод, определяющий принадлежность точки сектору.
   * \param[in] point  -- точка;
   * \return true, если точка принадлежит сектору;
   *         false -- иначе.
   */
  bool isPointInSector(const Point2D& point) const noexcept;
//==============================================================================
  /*!
   * \brief line - представление дуги как ломаной линии
   * \param[in|out] resultArc   - массив точек на плоскости,
   * куда будет дозаписана дуга в виде набора вершин ломаной линии;
   * \param[in]  segmentsNumber - количество точек для представления
   * окружности.
   * \details Кольцо,
   * сформированное этим методом,
   * имеет направление обхода "против часовой стрелки".
   */
  void
  line(std::vector<Point2D>& resultArc, uinttype segmentsNumber) const noexcept;
//==============================================================================
protected:
//==============================================================================
  uinttype        mId = 0U;       //!< идентификатор дуги;
  Point2D         mCenter;        //!< центральная точка;
  uinttype        mCenterId = 0U; //!< идентификатор центральной точки;
  uinttype        mTaskId = 0U;   //!< id задания, создавшего дугу;
  uinttype        mParentTaskId;  //!< id задания, породившего задание,
                                  //!< которое создало дугу;
  double          mRadius = 0.;   //!< радиус дуги;
  Angle           mBeginAngle;    //!< начальный угол;
  double          mSize = 0.;     //!< размер дуги (радианы);
  ArcBeginEndInfo mBeginInfo;     //!< тип обрыва начала;
  ArcBeginEndInfo mEndInfo;       //!< тип обрыва конца;
  uinttype        mArcBeginInfo   //!< доп. информация начала
                  = 0U;           //!< (зависит от mBeginInfo).
                                  //!< ByRefPoint - id точки преломления;
                                  //!< ByViewZone - не используется;
                                  //!< ByEdge - id начальной точки границы;
                                  //!< ByCut - не используется;
  uinttype        mArcEndInfo     //!< доп. информация конца (зависит от
                  = 0U;           //!< mEndInfo, аналогично mArcBeginInfo);  
  Box2D           mBox;           //!< коробка;
//==============================================================================
  /*!
   * \brief recalcBox -- функция пересчёта коробки.
   */
  void recalcBox() noexcept;
//==============================================================================
};
//==============================================================================
//==============================================================================
/*!
 * \brief Полидуга
 * \details Набор сопряжённых или пересеченных дуг.
 */
class Polyarc
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор
   */
  Polyarc() noexcept
    : mBox(Point2D(), Point2D())
  { }
//==============================================================================
  /*!
   * \brief Конструктор
   * \param[in] arc - дуга.
   */
  Polyarc(const Arc& arc) noexcept;
//==============================================================================
  /*!
   * \brief Конструктор
   * \param[in] arcs - дуги.
   */
  Polyarc(const std::deque<Arc>& arcs) noexcept;
//==============================================================================
  /*!
   * \brief beginArc -- метод, возвращающий начальную дугу полидуги.
   * \return начальная дуга полидуги.
   * \throws ReachableAreaFailure # ArcsArcReferenceFromEmptyPolyarc
   */
  const Arc& beginArc() const;
//==============================================================================
  /*!
   * \brief endArc -- метод, возвращающий конечную дугу полидуги.
   * \return конечная дуга полидуги.
   * \throws ReachableAreaFailure # ArcsArcReferenceFromEmptyPolyarc
  */
  const Arc& endArc() const;
//==============================================================================
  /*!
   * \brief addToBegin -- метод, добавляющий дугу в начало полидуги.
   * \param[in] arc -- дуга, которую требуется добавить.
   * \return true, если дуга была успешно добавлена;
   *         false -- иначе.
   */
  bool addToBegin(const Arc& arc) noexcept;
//==============================================================================
  /*!
   * \brief addToEnd -- метод, добавляющий дугу в конец полидуги.
   * \param[in] arc -- дуга, которую требуется добавить.
   * \return true, если дуга была успешно добавлена;
   *         false -- иначе.
   */
  bool addToEnd(const Arc& arc) noexcept;
//==============================================================================
  /*!
   * \brief addToEndWithoutCheck -- метод,
   * добавляющий дуги другой полидуги в конец полидуги.
   * \param[in] polyarc -- полидуга, дуги которой требуется добавить.
   */
  void addToEndWithoutCheck(const Polyarc& polyarc) noexcept;
//==============================================================================
  /*!
   * \brief arcs -- метод, возвращающий дуги полидуги.
   * \return -- ссылка на двустороннюю очередь дуг.
   */
  inline const std::deque<Arc>& arcs() const noexcept
  {
    return mArcs;
  }
//==============================================================================
  /*!
   * \brief line -- метод, возвращающий приближение полидуги
   * в виде ломаной линии.
   * \param[in|out] resultPolyarc  - массив вершин,
   * в который будут дозаписаны вершины полигонального приближения полидуги;
   * \param[in]  segmentsNumber - количество точек для представления окружности.
   * \details Кольцо,
   * сформированное этим методом,
   * имеет направление обхода "против часовой стрелки".
   */
  void line(
    std::vector<Point2D>& resultPolyarc,
    uinttype segmentsNumber) const noexcept;
//==============================================================================
  /*!
   * \brief get -- метод, возвращающий дугу по её id и углу,
   * который она содержит.
   * \param[in]     arcId    - id дуги, которую хотим получить;
   * \param[in]     angle    - угол, принадлежащий дуге;
   * \param[in|out] position - позиция дуги в списке дуг;
   * \param[in|out] arc      - дуга;
   * \return true, если дуга с заданными праметрми найдена в настоящей полидуге;
   *         false - иначе.
   * \details Если дуга с заданными параметрами не нашлась,
   * объекты, ссылки на которые передаются в качестве возвращаемых параметров,
   * остаются нетронутыми, как и сами эти объекты.
   */
  bool getArc(
    uinttype arcId,
    Angle angle,
    uinttype& position,
    Arc& arc) const noexcept;
//==============================================================================
  /*!
   * \brief isClosed -- метод, проверяющий замкнутость полидуги.
   * \return true, если полидуга замкнута;
   *         false - иначе.
   */
  bool isClosed() const noexcept;
//==============================================================================
  /*!
   * \brief box -- метод, возвращающий коробку.
   * \return коробка.
   */
  inline const Box2D& box() const noexcept
  {
    return mBox;
  }
//==============================================================================
  /*!
   * \brief toPolygon -- метод,
   * возвращающий полигональное представление полидуги.
   *
   * \param[in] segmentsNumber -- количество точек,
   * которое требуется использовать для приближения целой окружности.
   *
   * \return искомый многоугольник.
   */
  Polygon2D toPolygon(uinttype segmentsNumber = 360U) const noexcept;
//==============================================================================
protected:
//==============================================================================
  std::deque<Arc> mArcs; //!< Составляющие дуги.
  Box2D           mBox;  //!< Коробка.
//==============================================================================
};
//==============================================================================
//==============================================================================
/*!
 * \brief Геометрия, состоящая из набора полидуг и полилиний.
 */
class SemiarcContour
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор.
   */
  inline SemiarcContour() noexcept
  { }
//==============================================================================
  /*!
   * \brief push -- метод, добавляющий полидугу в конец геометрии.
   * \param[in] polyarc - полидуга, которую требуется добавить.
   */
  void push(const Polyarc& polyarc) noexcept;
//==============================================================================
  /*!
   * \brief push -- метод, добавляющий очередную вершину в конец геометрии.
   * \param[in] point - вершина, которую требуется добавить.
   */
  void push(const Point2D& point) noexcept;
//==============================================================================
  /*!
   * \brief push -- метод, добавляющий ломаную в конец геометрии.
   * \param[in] polyline - ломаная, которую требуется добавить.
   */
  void push(const std::vector<Point2D>& polyline) noexcept;
//==============================================================================
  /*!
   * \brief line -- метод, возвращающий представление настоящей геометрии
   * в виде ломаной линии.
   * \param[in|out] resultSemiarc -- ломаная линия,
   * в конец которой будет записано приближение геометрии;
   * \param[in] segmentsNumber -- количество точек,
   * которое требуется использовать для приближения целой окружности.
   * \details Кольцо,
   * сформированное этим методом,
   * имеет направление обхода "против часовой стрелки".
   */
  void line(
    std::vector<Point2D>& resultSemiarc,
    uinttype segmentsNumber) const noexcept;
//==============================================================================
  /*!
   * \brief toPolygon -- метод,
   * возвращающий полигональное представление геометрии.
   *
   * \param[in] segmentsNumber -- количество точек,
   * которое требуется использовать для приближения целой окружности.
   *
   * \details геометрия интерпретируется
   * как внешнее кольцо получаемого многоугольника.
   *
   * \return искомый многоугольник.
   */
  Polygon2D toPolygon(uinttype segmentsNumber = 360U) const noexcept;
//==============================================================================
protected:
//==============================================================================
  std::vector<Polyarc> mPolyarcs;  //!< Полидуги.
  std::vector<Point2D> mPoints;    //!< Точки.
  //!< Типы элементов (считая от начала, true - точка, false - полидуга).
  std::vector<bool>    mElemTypes; 
//==============================================================================
};
//==============================================================================
/*!
 * \brief Менеджер дуг
 * \details Служит для накопления дуг во время расчёта и их последующей
 *          склейки в контур зоны достижимости.    
 */
class ArcManager : public QObject
{
  Q_OBJECT
//==============================================================================
protected:
//==============================================================================
  /*!
   * \brief Точка пересечения двух дуг.
   */
  struct ArcIntersectPoint
  {
    Point2D point; //!< координаты;
    Angle  angle1; //!< азимут относительно центра первой дуги;
    Angle  angle2; //!< азимут относительно центра второй дуги.
  };
//==============================================================================
  /*!
   * \brief Типы пересечений двух дуг.
   */
  enum ArcIntersectType
  {
    NoIntersect,     //!< нет пересечений;
    SingleIntersect, //!< одна точка пересечения;
    DoubleIntersect  //!< две точки пересечения.
  };
//==============================================================================
  /*!
   * \brief Информация о пересечениях двух дуг.
   */
  struct ArcIntersectInfo
  {
    ArcIntersectType  intersectType; //!< тип пересечения;
    ArcIntersectPoint point1;        //!< первая точка пересечения (если есть);
    ArcIntersectPoint point2;        //!< вторая точка пересечения (если есть).
  };
//==============================================================================
  /*!
   * \brief Пересечение двух дуг при склейке.
   */
  struct ArcIntersect
  {
    uinttype          id;             //!< идентификатор пересечения;
    uinttype          arc1id;         //!< идентификатор первой дуги;
    uinttype          arc2id;         //!< идентификатор второй дуги;
    ArcIntersectPoint intersectPoint; //!< точка пересечения;
    bool              active;         //!< активность (актуальность).
  };
//==============================================================================
  /*!
   * \brief Точка начала или конца дуги (терминальная точка), лежащая на
   * стороне какого-либо полигона окружения (границе).
   */
  struct ArcTerminatePointOnEdge
  {
    uinttype arcPos; //!< индекс дуги в общей очереди полидуги;
    //!< тип точки (true -- начальная, false -- конечная);
    bool     beginPoint;
    //!< расстояние от настоящей точки до начальной точки границы.
    double   distToEdgeBegin; 
  };
//==============================================================================
  /*!<
   * Тип, определяющий соответствие между сторонами полигонов (границами)
   * (определяются по id начальной точки)
   * и набором терминальных точек дуг, лежащих на них.
   * Набор должен быть отсортирован по дальности от начальной точки границы.
   */
  typedef std::map<uinttype, std::vector<ArcTerminatePointOnEdge>> EdgesArcInfo;
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор
   * \param[in] environment - среда, в которой производится расчёт.
   */
  ArcManager(const GeometryEnvironment& environment) noexcept;
//==============================================================================
  /*!
   * \brief push -- метод, добавляющий дуги в общий накопитель менеджера.
   * \param[in] arcs - массив дуг, которые требуется добавить.
   */
  void push(const std::vector<Arc>& arcs) noexcept;
//==============================================================================
  /*!
   * \brief merge - метод, осуществляющий сборку контура по накопленным дугам.
   * \param[in]  touchedPolygons - id достижимых полигонов;
   * \param[out] result          - результат склейки;
   * \param[in]  segmentsNumber  - количество точек, для представления
   *                               окружности.
   * \throws ReachableAreaFailure # ArcsNotBeginTerminalPointOnBorder
   *         ReachableAreaFailure # ArcsClockWiseInnerRing
   */
  void merge(
    const std::set<uinttype>& touchedPolygons,
    ReachableAreaResult& result,
    uinttype segmentsNumber);
//==============================================================================
  /*!
   * \brief abortMerge -- метод, прерывающий процесс сборки контура.
   */
  void abortMerge() noexcept;
//==============================================================================
  /*!
   * \brief Стадии сборки контура.
   * \details Соответсвуют стадиям расчёта области достижимости.
   */
  enum EMergeStage 
  {
    /*!<
     * расчистка области склейки от заведомо ненужных дуг (поглощенных другими);
     */
    PolyarcsClearingStage = 2, 
    IntersectsDetectionStage,  //!< определение всех пересечений дуг;
    PolyarcsMergeStage,        //!< объединение дуг;
    PolyarcsCheckStage,        //!< определение игнорируемых дуг;
    BordersDetectionStage,     //!< сборка внешнего кольца;
    HolesDetectionStage        //!< добавление внутренних колец.
  };
//==============================================================================
signals:
//==============================================================================
  /*!
   * \brief mergeInfo -- сигнал,
   * оповещающий о переходе на очередную стадию формирования области видимости.
   * \details
   * \stage == 2 (PolyarcsClearingStage): расчистка области склейки от
   * \заведомо ненужных дуг (поглощенных другими).
   * \                  param1 - кол-во обработанных дуг
   * \                  param2 - всего дуг
   * \stage == 3 (IntersectsDetectionStage): определение всех пересечений дуг.
   * \                  param1 - кол-во обработанных дуг
   * \                  param2 - всего дуг
   * \stage == 4 (PolyarcsMergeStage): объединение дуг по пересечениям.
   * \                  param1 - кол-во обработанных
   * \                  param2 - размер очереди
   * \stage == 5 (PolyarcsCheckStage): определение игнорируемых дуг.
   * \                  param1 - кол-во обработанных
   * \                  param2 - всего
   * \stage == 6 (BordersDetectionStage): сборка внешнего кольца.
   * \                  param1 - кол-во обработанных дуг
   * \                  param2 - всего
   * \stage == 7 (HolesDetectionStage): сборка внутренних колец.
   * \                  param1 - кол-во обработанных
   * \                  param2 - всего
   */
  void mergeInfo(ArcManager::EMergeStage stage, uinttype p1, uinttype p2) const;
//==============================================================================
protected:
//==============================================================================
  const GeometryEnvironment& mEnvironment;    //!< среда расчёта;
  uinttype                   mArcIdCounter    //!< счётчик идентификаторов дуг;
                             = 1;
  std::vector<Polyarc>       mPolyarcs;       //!< полидуги (накопитель);
  std::atomic_bool           mNeedAbortMerge; //!< флаг прерывания склейки.
//==============================================================================
  /*!
   * \brief arcIntersect - метод, определяющий пересечения между двумя дугами.
   * \param[in] arc1       - первая дуга;
   * \param[in] arc2       - вторая дуга;
   * \return информация о пересечениях.
   */
  ArcIntersectInfo arcIntersect(
    const Arc& arc1,
    const Arc& arc2) const noexcept;
//==============================================================================
  /*!
   * \brief calcAllIntersects - метод, определяющий пересечения
   * между накопленными в менеджере дугами.
   * \param[out] intersects - искомая информация о пересечениях.
   */
  void calcAllIntersects(std::vector<ArcIntersect>& intersects) const noexcept;
//==============================================================================
  /*!
   * \brief reverseIntersect -- метод, "выворачивающий" пересечение.
   * \details (из А относительно B делает B относительно А)
   * \param[in] intersect - информация о пересечении;
   * \return информация о "вывернутом" пересечении.
   */
  ArcIntersect reverseIntersect(const ArcIntersect& intersect) const noexcept;
//==============================================================================
  /*!
   * \brief getIntersectsForArc -- метод,
   * возвращающий пересечения с другми дугами менеджера для заданной дуги.
   * \details Заданная дуга является первой. пересечения отсортированы 
   * по возрастанию угла между начальным углом дуги и углом пересечения.
   * \param[in]  allIntersects - все пересечения;
   * \param[in]  arc           - дуга;
   * \param[out] intersects    - результат.
   * \return true, если пересечения найдены;
   *         false - иначе.
   */
  bool getIntersectsForArc(
    const std::vector<ArcIntersect>& allIntersects,
    const Arc& arc,
    std::vector<ArcIntersect>& intersects
    ) const noexcept;
//==============================================================================
  /*!
   * \brief splitPolyarc -- метод, возвращающий разделение полидуги на две части
   * по точке их пересечения.
   * \details Точка пересечения
   * должна относиться к одной из дуг разрезаемой полидуги
   * \param[in]  src      - исходная полидуга;
   * \param[in]  splitter - точка пересечения полученных полидуг;
   * \param[out] part1    - первая полученная полидуга;
   * \param[out] part2    - вторая полученная полидуга.
   */
  void splitPolyarc(const Polyarc& src, const ArcIntersect& splitter,
    Polyarc& part1, Polyarc& part2) const;
//==============================================================================
  /*!
   * \brief absorbPolyarc -- метод, возвращающий часть полидуги,
   * которая не содержится в другой полидуге.
   * \param[in]  src      - поглощаемая полидуга;
   * \param[in]  absorber - поглощающая полидуга;
   * \param[out] res      - непоглощённые участи поглощаемой полидуги.
   */
  void absorbPolyarc(const Polyarc& src, const Polyarc& absorber,
    std::vector<Polyarc>& res) const noexcept;
//==============================================================================
  /*!
   * \brief absorbPolyarcs -- метод, возвращающий массив частей полидуг,
   * которые не содержатся в другой полидуге.
   * \param[in|out] polyarcs - поглощаемые полидуги;
   * \param[in] absorber - поглощающая полидуга.
   */
  void absorbPolyarcs(std::vector<Polyarc>& polyarcs,
    const Polyarc& absorber) const noexcept;
//==============================================================================
  /*!
   * \brief deleteAbsorbedArcs -- метод, удаляющий из менеджера все полидуги,
   * содержащиеся в объединении остальных полидуг менеджера.
   */
  void deleteAbsorbedArcs() noexcept;
//==============================================================================
  /*!
   * \brief intersectAllPolyarcs -- выделение полидуг,
   *        которые могут являться участками результирующего контура.
   * \details Пересекает все полидуги, модифицируя mPolyarcs.
   *          Из набора накопленных полидуг формируется набор полидуг,
   *          не имеющих взаимных пересечений.
   */
  void intersectAllPolyarcs() noexcept;
//==============================================================================
  /*!
   * \brief calcEdgesArcInfo -- формирование таблицы соответствий
   * между сторонами полигонов окружения (границами)
   * (определяются по id начальной точки)
   * и набором терминальных точек дуг, лежащих на них.
   * \details Каждый набор отсортирован по дальности от начальной точки
   *          границы.
   * \param[out] edgesArcInfo -- искомая таблица соответствий.
   * \throws ReachableAreaFailure # ArcsPolyarcBreakNoByEdge
   *         ReachableAreaFailure # ArcsPolyarcNullBeginInfo
   *         ReachableAreaFailure # ArcsPolyarcNullEndInfo
   */
  void calcEdgesArcInfo(EdgesArcInfo &edgesArcInfo) const;
//==============================================================================
  /*!
   * \brief calcPolyarcsActualities - формирование набора актуальностей полидуг
   * \details Неактуальными считаются полидуги, не являющиеся участками
   *          итоговой границы, т.е. такие, относительно которых с любой
   *          из сторон в эпсилон-окрестности найдётся участок достижимой 
   *          зоны.
   * \param[in]  edgesArcInfo        - границы/полидуги;
   * \param[out] polyarcsActualities - результат.
   * \throws ReachableAreaFailure # ArcsPolyarcBeginPointNotFound
   */
  void calcPolyarcsActualities(
    const EdgesArcInfo& edgesArcInfo,
    std::vector<bool>& polyarcsActualities) const;
//==============================================================================
  /*!
   * \brief isPolygonCW -- метод,
   * определяющий направление обхода кольца многоугольника.
   * \param[in]  polygon - кольцо многоугольника;
   * \return true, если направление обхода -- по часовой стрелке;
   *         false - иначе.
   */
  bool isPolygonCW(const std::vector<Point2D> & polygon) const noexcept;
//==============================================================================
  /*
   * \brief clearArcs -- метод, сбрасывающий всю информацию о дугах в объекте.
   */
  void clearArcs() noexcept;
//==============================================================================
};
//==============================================================================
} //! ReachableAreaCalculator
#endif // REACHABLEAREACALCULATOR_INNER_ARCS_H
