#ifndef REACHABLEAREACALCULATOR_INNER_SUBENVIRONMENT_H
#define REACHABLEAREACALCULATOR_INNER_SUBENVIRONMENT_H
//==============================================================================
#include <Inner/GeometryEnvironment.hpp>
//! std
#include <vector>
//==============================================================================
namespace ReachableAreaCalculator
{
//==============================================================================
class AbstractSubEnvironmentCutter;
//==============================================================================
/*
* \brief Суб-среда
* \details Суб-среда, по сути, есть часть среды, для которой 
* \        выполняется одна итерация алгоритма (нахождение полигона,
* \        основанного на полигоне видимости).
*/
class GeometrySubEnvironment : public EnvironmentObject
{
//==============================================================================
  friend class AbstractSubEnvironmentCutter;
//==============================================================================
public:
  //==============================================================================
  //! Граница (отрезок).
  //! Содержит локальные идентификаторы начальной и конечной точек
  typedef std::pair<uinttype, uinttype> Edge;
//==============================================================================
  /*
  * \brief Получение границ
  * \return границы, попавшие в суб-среду.
  */
  const std::vector<Edge>& edges() const
  {
    return mEdges;
  }
//==============================================================================
  /*
  * \brief Получение id полигонов суб-среды
  * \return id полигонов суб-среды.
  */
  const std::vector<uinttype>& polygonsIds() const
  {
    return mPolygonsIds;
  }
//==============================================================================
private:
//==============================================================================
  /*
  * \brief Конструктор
  * \param[in] parent - среда.
  */
  GeometrySubEnvironment(const GeometryEnvironment* parent) 
    : EnvironmentObject(parent)
  { }
//==============================================================================
  std::vector<Edge>     mEdges;       //! границы, попавшие в суб-среду
  std::vector<uinttype> mPolygonsIds; //! id полигонов суб-среды
};
//==============================================================================
//==============================================================================
/*
* \brief Абстрактная обрезалка
*/
class AbstractSubEnvironmentCutter
{
//==============================================================================
public:
//==============================================================================
  /*
  * \brief Конструктор
  */
  AbstractSubEnvironmentCutter() 
    : mBox(Point2D(), Point2D())
  { }
//==============================================================================
  /*
  * \brief Деструктор
  */
  virtual ~AbstractSubEnvironmentCutter(){}
//==============================================================================
  /*
  * \brief Создание новой суб-среды из среды
  * \details С выделением памяти
  * \param[in] parent - среда.
  */
  virtual GeometrySubEnvironment* generateCuttedSubEnvironment(
    const GeometryEnvironment* parent) const;
//==============================================================================
  /*
  * \brief Создание новой суб-среды из суб-среды
  * \details С выделением памяти
  * \param[in] parentSub - суб-среда.
  */
  virtual GeometrySubEnvironment* generateCuttedSubEnvironment(
    const GeometrySubEnvironment* parentSub) const;
//==============================================================================
  /*
  * \brief Получение коробки
  * \return коробка
  */
  const Box2D& box() const
  {
    return mBox;
  }
//==============================================================================
protected:
//==============================================================================
  Box2D mBox; // коробка суб-среды
//==============================================================================
private:
//==============================================================================
  /*
  * \brief Проверка принадлежности границы суб-среде
  * \param[in] p1 - первая точка границы;
  * \param[in] p2 - вторая точка границы;
  * \return true  - граница принадлежит суб-среде;
  *         false - не принадлежит.
  */
  virtual bool testEdge(const Point2D& p1, const Point2D& p2) const = 0;
};
//==============================================================================
//==============================================================================
/*
* \brief Обрезалка кругом
*/
class CircleSubEnvironmentCutter : public AbstractSubEnvironmentCutter
{
//==============================================================================
public:
//==============================================================================
  /*
  * \brief Конструктор
  */
  CircleSubEnvironmentCutter() 
    : mCenter()
    ,mRadius(0)
  { }
//==============================================================================
  /*
  * \brief Инициализация круга обрезки
  * \param[in] center - центр круга;
  * \param[in] radius - радиус круга.
  */
  void set(const Point2D& center, double radius);
//==============================================================================
private:
//==============================================================================
  Point2D mCenter; //! центр круга обрезки
  double mRadius;  //! радиус круга обрезки
//==============================================================================
  /*
  * \brief Проверка принадлежности границы суб-среде
  * \param[in] p1 - первая точка границы;
  * \param[in] p2 - вторая точка границы;
  * \return true  - граница принадлежит суб-среде;
  *         false - не принадлежит.
  */
  bool testEdge(const Point2D& p1, const Point2D& p2) const;
//==============================================================================
};
//==============================================================================
//==============================================================================
/*
* \brief Обрезалка эллипсом
*/
class EllipseSubEnvironmentCutter : public AbstractSubEnvironmentCutter
{
//==============================================================================
public:
//==============================================================================
  /*
  * \brief Конструктор
  */
  EllipseSubEnvironmentCutter() 
    : mFirstFocus()
    , mSecondFocus()
    , mEllipseParam(0)
  { }
//==============================================================================
  /*!<
   * \brief set - инициализация круга обрезки
   * \param[in] f1 - первый фокус;
   * \param[in] f2 - второй фокус;
   * \param[in] l - параметр (для любой точки p на эллипсе 
   *                |p,f1|+|p,f2| == l).
   * \throws ReachableAreaFailure #
   *           EllipseSubEnvironmentCutterEllipseDoesNotExist
   */
  void set(const Point2D& f1, const Point2D& f2, double l);
//==============================================================================
private:
//==============================================================================
  Point2D mFirstFocus;      //! первый фокус эллипса
  Point2D mSecondFocus;     //! второй фокус эллипса
  double  mEllipseParam;    //! параметр (для любой p точки на эллипсе 
                            //! |p,f1|+|p,f2| == l)

  Radian  mEllipseAlpha;    //! поворот эллипса
  double  mEllipseAlphaSin; //! синус поворота эллипса
  double  mEllipseAlphaCos; //! косинус поворота эллипса
  double  mEllipseA;        //! большая полуось
  double  mEllipseB;        //! малая полуось
  double  mEllipseE;        //! эксцентриситет
  double  mEllipseC;        //! фокальное расстояние
  Point2D mEllipseCenter;   //! центр эллипса
//==============================================================================
  /*
  * \brief Проверка принадлежности границы суб-среде
  * \param[in] p1 - первая точка границы;
  * \param[in] p2 - вторая точка границы;
  * \return true  - граница принадлежит суб-среде;
  *         false - не принадлежит.
  */
  bool testEdge(const Point2D& p1, const Point2D& p2) const;
//==============================================================================
};
//==============================================================================
}//! ReachableAreaCalculator
 //==============================================================================
#endif // REACHABLEAREACALCULATOR_INNER_SUBENVIRONMENT_H
