#ifndef GEOMETRY_OBJECTS_BASIS_HPP
#define GEOMETRY_OBJECTS_BASIS_HPP
//==============================================================================
#include <Geometry/Objects/Vector3D.hpp>
//==============================================================================
namespace Geometry
{
//==============================================================================
/*!
 * \brief Базис (локальная система координат) в трехмерном евклидовом 
 *        пространстве.
 *        Задается точкой (началом координат) и тремя единичными векторами
 *        (осями координат).
*/
class Basis3D
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса по умолчанию (глобальный базис)
   */
  inline Basis3D() noexcept
  : mO(Point3D())
  , mI(Vector3D(1., 0., 0.))
  , mJ(Vector3D(0., 1., 0.))
  , mK(Vector3D(0., 0., 1.))
  {
    calcParams();
  }
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \details Все единичные вектора сохраняют свои проекции на оси, но меняют 
   *          точку привязки на точку, задаваемую в качестве начала координат.         
   * \param[in] i - единичный вектор, задающий ось OX для локального базиса 
   * \param[in] j - единичный вектор, задающий ось OY для локального базиса
   * \param[in] k - единичный вектор, задающий ось OZ для локального базиса
   * \param[in] zero - точка начала координат для локального базиса.
   * \throws GeometryFailure # NotABasis
   */
  Basis3D(const Vector3D& i,
          const Vector3D& j,
          const Vector3D& k,
          const Point3D& zero);
//==============================================================================
  /*!
   * \brief Копирующий конструктор класса
   * \param[in] basis - копируемый базис 
  */
  Basis3D(const Basis3D& basis)
  : mO(basis.mO)
  , mI(basis.mI)
  , mJ(basis.mJ)
  , mK(basis.mK)
  , mTMi(basis.mTMi)
  , mTMj(basis.mTMj)
  , mTMk(basis.mTMk)
  , mZero(basis.mZero)
  {
  }
//==============================================================================
  /*!
   * \brief Изменение базиса
   * \param[in] i - вектор, задающий ось OX для локального базиса
   * \param[in] j - вектор, задающий ось OY для локального базиса
   * \param[in] k - вектор, задающий ось OZ для локального базиса
   * \param[in] zero - точка начала координат для локального базиса.
   * \throws GeometryFailure # NotABasis
   */
  inline void set(const Vector3D& i, const Vector3D& j, const Vector3D& k,
                  const Point3D& zero)
  {
    *this = Basis3D(i, j, k, zero);
  }
//==============================================================================
  /*!
   * \brief Перевод координат точки из глобального базиса в локальный базис
   * \details Если базис - не базис, возвращается подаваемая точка
   * \param[in] point - координаты точки в глобальном базисе
   * \return Координаты точки в локальном базисе
   */
  Point3D fromGlobal(const Point3D& point) const noexcept;
//==============================================================================
  /*!
   * \brief Перевод координат точки из локального базиса в глобальный
   * \details Если базис - не базис, возвращается подаваемая точка
   * \param[in] point - координаты точки в локальном базисе
   * \return Координаты точки в глобальном базисе
   */
  Point3D toGlobal(const Point3D& point) const noexcept;
//==============================================================================
  /*!
   * \brief Перевод координат вектора из глобального базиса в локальный базис
   * \details Если базис - не базис, возвращается подаваемый вектор
   * \param[in] vector - координаты вектора в глобальном базисе
   * \return Координаты вектора в локальном базисе
   */
  Vector3D fromGlobal(const Vector3D& vector) const noexcept;
//==============================================================================
  /*!
   * \brief Перевод координат вектора из локального базиса в глобальный
   * \details Если базис - не базис, возвращается подаваемый вектор
   * \param[in] vector - координаты вектора в локальном базисе
   * \return Координаты вектора в глобальном базисе
   */
  Vector3D toGlobal(const Vector3D& vector) const noexcept;
//==============================================================================
  /*!
   * \brief Сравнение базисов на равенство 
   * \details Равны, если равны вектора и совпадает точка начала координат.
   * \param[in] basis - базис, с которым сравниваем
   * \return true  - базисы совпадают,
   *         false - базисы различаются
  */
  inline bool operator == (const Basis3D& basis) const
  {
    return (   (mI == basis.mI) && (mJ == basis.mJ) && (mK == basis.mK) 
            && (mO == basis.mO));
  }
//==============================================================================
  /*!
   * \brief Получение вектора, задающего ось OX для локального базиса
   * \return Вектор, задающий ось OX для локального базиса
  */
  inline Vector3D getI() const
  {
    return mI;
  }
//==============================================================================
  /*!
   * \brief Получение вектора, задающего ось OY для локального базиса
   * \return Вектор, задающий ось OY для локального базиса
  */
  inline Vector3D getJ() const
  {
    return mJ;
  }
//==============================================================================
  /*!
   * \brief Получение вектора, задающего ось OZ для локального базиса
   * \return Вектор, задающий ось OZ для локального базиса
  */
  inline Vector3D getK() const
  {
    return mK;
  }
//==============================================================================
  /*!
   * \brief Получение точки начала координат для локального базиса
   * \return Точка начала координат для локального базиса
  */
  inline Point3D getZero() const
  {
    return mO;
  }
//==============================================================================
protected:
//==============================================================================
  /*!
   * \brief Вычисление вспомогательных параметров базиса
   * \details Вычисляются: - признак базиса;
   *                       - матрица перехода;
   *                       - точка начала относительно глобальной СК.
   * \throws GeometryFailure # NotABasis
   */
  void calcParams();
//==============================================================================
  Point3D mO;   //!< Начало координат
  Vector3D mI;  //!< ось OX
  Vector3D mJ;  //!< ось OY
  Vector3D mK;  //!< ось OZ

  //! Матрица перехода (TM - Transition Matrix) разбитая по векторам
  Vector3D mTMi; //!< Вектор коэффициентов перехода по оси, заданной вектором i
  Vector3D mTMj; //!< Вектор коэффициентов перехода по оси, заданной вектором j
  Vector3D mTMk; //!< Вектор коэффициентов перехода по оси, заданной вектором k
  
  Point3D mZero; //!< Глобальная точка начала координат в локальном базисе 
//==============================================================================
  //! Обеспечение доступа к параметрам базиса внутри классов
  friend class TransitionBases;
//==============================================================================
};
//==============================================================================
} //! Geometry
//==============================================================================
#endif //! GEOMETRY_OBJECTS_BASIS_HPP