#ifndef GEOMETRY_OBJECTS_BORDEREDLINE_HPP
#define GEOMETRY_OBJECTS_BORDEREDLINE_HPP
//==============================================================================
#include <Geometry/Objects/Line.hpp>
#include <Geometry/Operations/AtPoints2D.hpp>
//! Point
#include <Point/Point2D.hpp>
//==============================================================================
namespace Geometry
{
//==============================================================================
  /*!
  * \brief Положения точки относительно отрезка из двух других вершин
  */
  enum PlanePosition
  {
    Left			    //!< Слева
    , Right			  //!< Справа
    , Beyond		  //!< Сверху (За финишной точкой в направлении линии отрезка)
    , Behind		  //!< Снизу (Перед стартовой точкой в направлении линии отрезка)
    , Between		  //!< На отрезке
    , Origin		  //!< Начало отрезка
    , Destination	//!< Конец отрезка
  };
//==============================================================================
  /*!
  * \brief Отрезок в двухмерном евклидовом пространстве
  * \details Имеет заданное направление
  */
class BorderedLine : public Line
{
//==============================================================================
public:
//==============================================================================
  /*!
  * \brief Конструктор класса по двум точкам
  * \param[in] startPoint - первая точка
  * \param[in] finishPoint - вторая точка
  */
  BorderedLine(const Point2D & startPoint, const Point2D & finishPoint);
//==============================================================================
  /*!
  * \brief Проверка отрезков на совпадение
  * \details Проверяются совпадение отрезка с заданным.
  * \param[in] borderLine - отрезок;
  * \return true  - отрезки совпадают;
  * \       false - отрезки не совпадают.
  */
   inline bool isEqual(const BorderedLine& borderLine) const
   {
     return ((mStart == borderLine.mStart) && (mFinish == borderLine.mFinish));
   }
//==============================================================================
   /*!
   * \brief Поиск длины отрезка
   * \return длина отрезка
   */
   inline double getLength() const
   {
     return distance(mStart, mFinish);
   }
//==============================================================================
  /*!
  * \brief Проверка попадания точки на отрезок с учетом граничных точек
  * \
  * \param[in] point - точка.
  * \return    true  - попадает на отрезок;
  * \          false - не попадает на отрезок.
  */
  bool atBorderLine(const Point2D& point) const;
//==============================================================================
  /*!
  * \brief Проверка попадания точки на отрезок с учетом граничных точек
  * \      с заданной погрешностью
  *
  * \details Проверяется попадание точки в прямоугольник, стороны которого
  *          исходят из вершин отрезка и параллельны координатным осям.
  *          Для случая параллельности отрезка одной из координатных осей
  *          проверяется, что точка отклоняется от оси, которой
  *          перпендикулярна, не более чем на заданную погрешность. Главная
  *          задача функции - отсечь случаи, когда точка рядом с отрезком, но
  *          за пределами его границ.
  *
  * \param[in] point - точка.
  * \param[in] eps - погрешность.
  * \return    true  - попадает на отрезок;
  * \          false - не попадает на отрезок.
  */
  bool nearBorderLine(
    const Point2D& point, const double eps = ACCURACY_DOUBLE) const;
//==============================================================================
  /*!
   * \brief Проверка на пересечение отрезка с заданным отрезком
   * \      с учётом концевых вершин
   * \param[in] borderLine - отрезок;
   * \return true  - есть пересечение отрезков;
   * \       false - нет пересечения отрезков.
   */
  bool isIntersect(const BorderedLine& borderLine) const;
//==============================================================================
  /*!
  * \brief Проверка на пересечение отрезка с заданным отрезком
  * \      не в концевой вершине
  * \param[in] borderLine - отрезок;
  * \return true  - есть пересечение отрезков не в концевой вершине;
  * \       false - нет пересечения отрезков не в концевой вершине.
  */
  bool isIntersectWithoutBorder(const BorderedLine& borderLine) const;
//==============================================================================
  /*!
  * \brief Определение положения точки относительнго отрезка
  * \param[in] point - точка;
  * \return положение точки;
  */
  PlanePosition position(const Point2D& point) const;
//==============================================================================
/*!
* \brief Поиск точки на прямой
* \details Поиск координат точки, находящейся на прямой на заданном
* \  расстоянии от второй точки отрезка вне(на) отрезка
* \param[in] dist   - расстояние удаления искомой точки от второй 
* \                     точки отрезка;
* \param[in] atLine - если true - поиск точки по направлению внутрь 
* \                     отрезка, иначе - от него;
* \return найденная точка.
*/
  Point2D findPointAtLine(double dist, bool atLine);
//==============================================================================
/*!
* \brief Поиск точки на прямой, перпендикулярной заданной
* \details Поиск координат точки, находящейся на прямой,
* \        перпендикулярной заданной
* \param[in] pointCross  - точка, принадлежащая обеим прямым, в ней 
* \                        проходит перпендикулярная прямая;
* \param[in] dist        - расстояние до точки на перпендикулярной прямой;
* \param[in] isLeftPoint - если true - возвращается точка, находящаяся
* \                        слева от исходного отрезка, иначе - справа;
* \return точка на перпендикулярной прямой.
*/
  Point2D findPointAtPerpendLine(
    const Point2D& pointCross, double dist, bool isLeftPoint) const;
//==============================================================================
  /*!
   *\brief Получить точку начала отрезка
   *\return - точка начала отрезка
   */
  inline const Point2D& getStart() const noexcept
  {
    return mStart;
  }
//==============================================================================
  /*!
   *\brief Получить точку конца отрезка
   *\return - точка конца отрезка
   */
  inline const Point2D& getFinish() const noexcept
  {
    return mFinish;
  }
//==============================================================================
protected:
//==============================================================================
  Point2D  mStart;      //!< точка начала отрезка
  Point2D  mFinish;      //!< точка конца отрезка                  
//==============================================================================
};
//==============================================================================
} //! Geometry
//==============================================================================
#endif //! GEOMETRY_OBJECTS_BORDEREDLINE_HPP
