#ifndef GEOMETRY_OBJECTS_LINE_HPP
#define GEOMETRY_OBJECTS_LINE_HPP
//==============================================================================
//! Point
#include <Point/Point2D.hpp>
//! std
#include <tuple>
//==============================================================================
namespace Geometry
{
//==============================================================================
/*!
 * \brief Прямая в двухмерном евклидовом пространстве
 * \details Прямая задается уравнением ax + by + c = 0.
 *    Допустимы прямые, параллельные оси Oy.
 */
class Line
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса по двум точкам
   * \param[in] firstPoint - первая точка
   * \param[in] secondPoint - вторая точка
   * \throws GeometryFailure # LineThroughOnePoint
   */
  Line( const Point2D & firstPoint, const Point2D & secondPoint );
//==============================================================================
  /*!
   * \brief Конструктор класса по трем параметрам (вид ax + by + c = 0)
   * \param[in] a - первый параметр
   * \param[in] b - второй параметр
   * \param[in] c - третий параметр
   * \throws GeometryFailure # LineWithZeroParams
   */
  Line( const double a, const double b, const double c );
//==============================================================================
  /*!
   * \brief Конструктор класса по двум параметрам (вид y = kx + b)
   * \param[in] k - первый параметр
   * \param[in] b - второй параметр
   */
  Line( const double k, const double b );
  //==============================================================================
  /*!
   * \brief Конструктор класса по первой точке и углу наклона
   * \param[in] firstPoint - точка
   * \param[in] slope      - наклон
   */
  Line(const Point2D& firstPoint, Radian slope);
//==============================================================================
  /*!
   * \brief Угол наклона прямой (!с учетом направления!)
   * \details Полярный угол относительно Ox,
   *         всегда лежит в интервале [-pi .. pi]
   * \return угол наклона
   */
  Radian getSlope(  ) const;
//==============================================================================
  /*!
   * \brief Угол наклона прямой с противоположным направлением
   * \details Полярный угол относительно Ox,
   *         всегда лежит в интервале [-pi .. pi]
   * \return угол наклона
   */
  Radian getReversedSlope() const;
//==============================================================================
  /*!
   * \brief Угол поворота при переходе с текущей прямой на другую
   * \details Положителен при повороте направо (по часовой стрелке),
   *    лежит в интервале [-pi .. pi]
   * \return угол поворота
   */
  Radian getAngleTo( const Line& anotherLine ) const;
//==============================================================================
  /*!
   * \brief Получить коэффициенты общего уравнения прямой ax + by + c = 0
   * \return коэффициенты (a, b, c)
   */
  std::tuple <double, double, double> getAllCoeffs( ) const;
//==============================================================================
  /*!
   * \brief Получить коэффициенты упрощенного уравнения прямой y = kx + b
   * \details Решение корректно только для прямой, не параллельной оси Oy
   * \return коэффициенты (k, b)
   * \throws GeometryFailure : BaseCoefsForVerticalLine
   */
  std::pair <double, double> getBaseCoeffs( ) const;
//==============================================================================
  /*!
   * \brief Получить направление прямой
   * \details Прямая, параллельная оси Oy направлена вперед, если значения y
   *    увеличиваются. Остальные прямые направлены вперед, если увеличивается x
   * \return true  - прямая направлена вперёд
   *         false - напавление прямой противоположное
   */
  bool isForward( ) const;
//==============================================================================
  /*!
   * \brief Проверить, параллельна ли прямая оси Oy
   * \details Прямые, не параллельные Oy, могут быть описаны уравнением
   *         y = kx + b
   * \return true  - прямая параллельна оси Oy
   *         false - прямая не параллельна оси Oy
   */
  bool isVertical( ) const;
//==============================================================================
  /*!
   * \brief Построить перпендикулярную прямую, проходящую через данную точку
   * \details Точка может лежать как на текущей прямой, так и вне нее.
   *         Направление перпендикулярной прямой совпадает с направлением
   *         исходной.
   * \param[in] point - точка, принадлежащая искомой прямой
   * \return полученная прямая
   */
  Line perpendicularLine( const Point2D& point ) const;
//==============================================================================
  /*!
   * \brief Проверить, лежит ли точка на прямой
   * \param[in] point - проверяемая точка
   * \return true  - точка принадлежит прямой
   *         false - точка не принадлежит прямой
   */
  bool hasPoint( const Point2D& point ) const;
//==============================================================================
  /*!
   * \brief Проверить, лежит ли точка на прямой с заданной погрешностью
   * \param[in] point - проверяемая точка
   * \param[in] eps   - погрешность
   * \return true  - точка принадлежит прямой
   *         false - точка не принадлежит прямой
   */
  bool hasPointNear(
    const Point2D& point, const double eps = ACCURACY_DOUBLE) const;
//==============================================================================
  /*!
   * \brief Построить противоположно направленную прямую
   * \return полученная прямая
   */
  Line reversedLine() const;
//==============================================================================
  /*!
   * \brief Построить параллельную прямую, проходящую через данную точку
   * \param[in] point - точка, принадлежащая искомой прямой
   * \return полученная прямая
   */
  Line parallelLine( const Point2D& point ) const;
//==============================================================================
  /*!
   * \brief Построить параллельную прямую на заданном расстоянии от исходной
   * \param[in] distance - растояние, на которое от текущей линии необходимо
   *                       отодвинуть новую
   * \param[in] isLeftSide - линия отодвигается влево от исходной
   * \return полученная прямая
   */
  Line parallelLine(double distance, bool isLeftSide) const;
//==============================================================================
  /*!
   * \brief Перенос прямой в новую систему координат
   * \param[in] point - центр новой системы координат
   * \return прямая в новой системе координат
   */
  Line parallelTranslation(const Point2D& point) const;
//==============================================================================
  /*!
   * \brief Проверить, параллельна ли текущая прямая указанной
   * \details Совпадающие прямые также считаются параллельными
   * \param[in] anotherLine - проверяемая прямая
   * \return true  - прямые параллельны
   *         false - прямые не параллельны
   */
  bool isParallel( const Line& anotherLine ) const;
//==============================================================================
  /*!
   * \brief Проверить, совпадает ли текущая прямая с указанной
   * \details С точностью до направления
   * \param[in] anotherLine - проверяемая прямая
   * \return true  - прямые совпадают
   *         false - прямые не совпадают
   */
  bool isSameTo( const Line& anotherLine ) const;
//==============================================================================
  /*!
   * \brief Пересечение двух прямых
   * \param[in] line - вторая прямая
   * \return точка пересечения (при наличии)
   * \throws GeometryFailure # SameLinesIntersect
   * \throws GeometryFailure # ParallelLinesIntersect
   */
  Point2D crossPoint( const Line& anotherLine ) const;
//==============================================================================
  /*!
   * \brief Пересечение двух прямых
   * \details Для параллельных прямых координаты точки пересечения (0, 0)
   * \param[in] line - вторая прямая
   * \param[out] crossPoint - точка пересечения 
   * \return true  - прямые пересеклись
   *         false - прямые не пересеклись или совпадают
   */
  bool crossPoint( const Line& anotherLine, Point2D& crossPoint ) const;
//==============================================================================
  /*!
   * \brief Поиск точки на линии на заданном расстоянии от заданной точки
   * \param[in] point       - точка, от которой откладывается расстояние
   * \param[in] dist        - расстояние между заданной и найденной точкой
   * \param[in] changePoint - если заданная точка не лежит на прямой,
   *                          то при true меняем её координату y так, чтобы
   *                          она лежала (или x - в случае параллельности
   *                          оси y), при false - кидаем исключение
   * \param[in] alongLine   - если true - ищем точку по направлению прямой,
   *                          иначе - в обратном направлении
   * \return точка на линии
   * \throws GeometryFailure # IncorrectPoint
   */
  Point2D findPoint(
    const Point2D& point, double dist, bool changePoint = false,
    bool alongLine = true) const;
//==============================================================================
  /*!
   * \brief Поиск расстояния от точки до линии
   * \param[in] point - точка, от которой ищется расстояние
   * \return расстояние от точки до линии
   */
  double distanceFromPoint(const Point2D& point) const;
//==============================================================================
  /*!
   * \brief Поиск ближайшей точки линии к заданной точке
   * \param[in] point - точка, ближайшая к которой ищется
   * \return Точка линии, ближайшая к заданной точке
   */
  Point2D findNearestLinePoint(const Point2D& point) const;
//==============================================================================
//==============================================================================
protected:
//==============================================================================
  Line ()
  : mA( 1. )
  , mB( -1. )
  , mC( 0. )
  , mIsForward (true )
  {}
//==============================================================================
  double  mA;      //!< проекция на ось OX
  double  mB;      //!< проекция на ось OY
  double  mC;      //!< проекция на ось OZ
  bool    mIsForward;  //!< прямая направлена вперёд (x увеличивается.
                       //!< если прямая параллельна Oy, то y увеличивается)
//==============================================================================
};
//==============================================================================
} //! Geometry
//==============================================================================
#endif //! GEOMETRY_OBJECTS_LINE_HPP
