#ifndef REACHABLEAREACALCULATOR_INNER_ENVIRONMENT_H
#define REACHABLEAREACALCULATOR_INNER_ENVIRONMENT_H
//==============================================================================
//! Point
#ifndef Q_MOC_RUN
#include <PrimaryEntities/GeometryEntities.hpp>
#endif
//! std
#include <vector>
//==============================================================================
namespace ReachableAreaCalculator
{
//==============================================================================
class GeometryEnvironment;
//==============================================================================
/*
* \brief Класс, описывающий среду, т.е. набор полигонов
* \details Введено для случая получения задания из пустой очереди
* \        Полигоны, добавляемые в среду, должны удовлетворять
* \        следующим требованиям:
* \        а) не иметь самопересечений
* \        б) не иметь взаимных пересечений
* \        в) быть направленными по часовой стрелке (или против
* \        часовой стрелки, если препятствием является внутренняя
* \        граница полигона (случай Каспийского моря или озёр)
* \        г) быть невырожденными, т.е. иметь ненулевую площадь
*/
class Environment
{
//==============================================================================
public:
//==============================================================================
  /*
  * \brief Конструктор
  * \details Создаётся среда из набора полигонов
  * \param[in] polygons - набор полигонов
  */
  Environment(const std::vector<Polygon2D>& polygons = std::vector<Polygon2D>());
//==============================================================================
  /*
  * \brief Деструктор
  */
  ~Environment();
//==============================================================================
  /*
  * \brief Добавление полигона в среду
  * \param[in] polygon - добавляемый полигон
  */
  void addPolygon(const Polygon2D& polygon);
//==============================================================================
  /*
  * \brief Получение указателя на среду
  * \return указатель на среду.
  */
  const GeometryEnvironment* getInner() const;
//==============================================================================
private:
//==============================================================================
  GeometryEnvironment* inner = nullptr; // указатель на среду
//==============================================================================
};
//==============================================================================
}//! ReachableAreaCalculator
//==============================================================================

#endif // REACHABLEAREACALCULATOR_INNER_ENVIRONMENT_H
