#ifndef TRIANGULAR_GEOMETRY_STRUCTURE_HEAD_HPP
#define TRIANGULAR_GEOMETRY_STRUCTURE_HEAD_HPP
//==============================================================================
#include "Linkage.hpp"
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Link;

  /*
  * \brief Голова
  * \details Псевдоэлемент двунаправленного циклического списка, применяющийся
  * \        в качестве маркера на начало списка.
  */
class Head : public Linkage
{
public:
//==============================================================================
  /*
  * \brief Конструктор
  * \details Замыкание элемента самого на себя
  */
  static std::shared_ptr<Head> create();
//==============================================================================
	/*
  * \brief Проверка списка на пустоту
  * \details Проверяет список на наличие элементов, кроме головы.
  * \return true  - список пуст;
  * \       false - список не пуст.
  */
	bool isEmpty();
//==============================================================================
	/*
  * \brief Первый элемент списка
  * \details Возвращает указатель на первый элемент списка, не являющийся
  * \        головой.
  * \return Указатель на первый элемент списка.
  */
  std::shared_ptr<Link> first();
//==============================================================================
	/*
  * \brief Последний элемент списка
  * \details Возвращает указатель на последний элемент списка, не являющийся 
  * \        головой.
  * \return Указатель на последний элемент списка.
  */
  std::shared_ptr<Link> last();
//==============================================================================
	/*
  * \brief Количество элементов в списке
  * \details Производится подсчет элементов, входящих в список и не
  * \        являющихся головой.
  * \return Количество элементов в списке.
  */
	int cardinal();
//==============================================================================
	/*
  * \brief Очистка списка
  * \details Из списка исключаются все элементы, кроме головы, которая
  * \        замыкается сама на себя.
  */
	void clear();
//==============================================================================
  /*
  * \brief Разомкнуть список
  * \details Обязательна к выполнению при завершении работы с HEAD!
  * \        Размыкает список, делая ссылки на следующий и предыдущий 
  * \        элемент нулевыми. Перед этим список чистится.
  */
  void unlock();
//==============================================================================
  /*
  * \brief Замкнуть список
  * \details Обязательна к выполнению перед началом работы с HEAD, если до этого
  * \        вызывался unlock!
  * \        Замыкает список на себе.
  */
  void lock();
//==============================================================================
protected:
//==============================================================================
  /*
  * \brief Конструктор по умолчанию
  */
  Head();
//==============================================================================
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_STRUCTURE_HEAD_HPP
