#ifndef TRIANGULAR_GEOMETRY_STRUCTURE_LINK_HPP
#define TRIANGULAR_GEOMETRY_STRUCTURE_LINK_HPP
//==============================================================================
#include "Linkage.hpp"
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Head;

  /*
  * \brief Элемент списка
  */
class Link : public Linkage
{
public:
//==============================================================================
  /*
  * \brief Конструктор
  */
	Link();
//==============================================================================
	/*
  * \brief Исключение элемента из списка
  * \details Элемент убирается из списка. 
  */
	void out();
//==============================================================================
	/*
  * \brief Добавить элемент в список после указанного
  * \details Добавляется в список элемент после указанного.
  * \param[in] link - указатель на элемент, после которого добавляется данный 
  * \                 элемент в список.
  */
  void follow(std::shared_ptr<Link> link);
//==============================================================================
	/*
  * \brief Добавить элемент в список перед указанным
  * \details Добавляется в список элемент перед указанным.
  * \param[in] link - указатель на элемент, перед которым добавляется данный
  * \                 элемент в список.
  */
	void precede(std::shared_ptr<Link> link);
//==============================================================================
	/*
  * \brief Добавить элемент в конец списка
  * \details Добавляется в конец списка элемент.
  * \param[in] head - указатель на голову списка, в конец которого добавляется 
  * \                 данный элемент.
  */
  void into(std::shared_ptr<Head>& head);
//==============================================================================
  /*
  * \brief Деструктор
  * \details Перед удалением, элемент исключается из списка, в котором
  * \        находится. 
  */
	virtual ~Link();
//==============================================================================
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_STRUCTURE_LINK_HPP