#ifndef TRIANGULAR_GEOMETRY_STRUCTURE_LINKAGE_HPP
#define TRIANGULAR_GEOMETRY_STRUCTURE_LINKAGE_HPP
//==============================================================================
//! std
#include <memory>
//==============================================================================
namespace TriangularGeometry 
{
//==============================================================================
  /*!
  * \brief Связующая чаcть элемента
  * \details Часть элемента списка, отвечающего за взаимосвязь данного элемента
  * \        с остальными.
  * \        Хранит указатель на соседние элементы (следующий и предыдущий).
  */
class Linkage : public std::enable_shared_from_this<Linkage>
{
public:
//==============================================================================
  /*!
  * \brief Конструктор
  * \details Инициализирует указатели на соседей.
  */
	Linkage();
//==============================================================================
  /*!
  * \brief Следующий элемент (связующая чаcть)
  * \details Возвращает указатель на следующий элемент (связующую чаcть),
  * \        если он не является первым в списке.
  * \return Указатель на следующий элемент (связующую чаcть).
  */
  std::shared_ptr<Linkage> next();
//==============================================================================
  /*
  * \brief Предыдущий элемент (связующая чаcть)
  * \details Возвращает указатель на предыдущий элемент (связующую чаcть),
  * \        если он не является последним в списке.
  * \return Указатель на предыдущий элемент (связующую чаcть).
  */
  std::shared_ptr<Linkage> previous();
//==============================================================================
  /*
  * \brief Деструктор
  */
	virtual ~Linkage();
//==============================================================================

private:
	std::shared_ptr<Linkage> mNext;	  //!< Указатель на следующий элемент
  std::shared_ptr<Linkage> mPrev;  //!< Указатель на предыдущий элемент

	friend class Link;
	friend class Head;
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_STRUCTURE_LINKAGE_HPP

