#ifndef GEODESIC_GEOLINETOOLS_INNER_GEODESIC_LINE_HPP
#define GEODESIC_GEOLINETOOLS_INNER_GEODESIC_LINE_HPP
//==============================================================================
//! Point
#include <Point/GeoPoint2D.hpp>
//==============================================================================
//==============================================================================
namespace Geodesic
{
//==============================================================================
namespace Inner
{
//==============================================================================
  //! Значение по умолчанию для максимальной длины сегмента [м]
  constexpr float DEFAULT_MAX_SEGMENT_LENGTH = 50000.;
//==============================================================================
/*!
* \brief Класс обобщения геодезических линий: ортодромия и локсодромия
* \details Используется только для внутреннего использования при реализации
*/
class GeodesicLine
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Получение координаты точки, отстоящей от начальной точки 
   *        геодезической линии на заданное расстоение
   * \param[in] distance - расстояние от начальной точки по геодезической 
   *                       линии [м]
   * \return Координаты точки
   */ 
  virtual GeoPoint2D pointPosition(double distance) const = 0;
//==============================================================================
  /*!
   * \brief Получение координаты точки, отстоящей от начальной точки
   *        геодезической линии на заданное расстоение
   * \param[in] distance - расстояние от начальной точки по геодезической
   *                       линии [м]
   * \param[out] newAzimuth - азимут новой точки.
   * \return Координаты точки
   */
  virtual GeoPoint2D
  pointPosition(double distance, Radian& newAzimuth) const = 0;
//==============================================================================
  /*!
   * \brief Разбиение геодезической линии на равные сегменты, длиной не  
   *        превышающих заданную
   * \details Сначала вычисляется длина сегмента для равномерного разбиения.
   *          Может отличаться от заданной длины, но не превосходить её.
   *          Если максимальная длина сегмента меньше или равна 0, тогда 
   *          возвращается набор из двух точек: точки начала и точки завершения.
   *          Результат дозаписывается к указанному набору точек, при этом можно 
   *          дополнительно указать необходимость включения в результат точек
   *          начала и завершения.
   * \param[in|out] geoPoints - набор точек, в конец которого необходимо 
   *                            дозаписать точки, разбивающие текущую 
   *                            геодезическую линию на сегменты.
   * \param[in] maxSegmentLength - максимальная длина сегмента [м]
   *                               (должна быть больше 0).   
   * \param[in] hasIncludeStartPoint - признак включения точки начала в
   *                                   результирующий набор
   * \param[in] hasIncludeFinishPoint - признак включения точки завершения в
   *                                    результирующий набор
   * \return Длина сегмента, на которые была разбита геодезическая линия [м]
  */ 
  virtual double divide(std::vector<GeoPoint2D>& geoPoints, 
                        double maxSegmentLength = DEFAULT_MAX_SEGMENT_LENGTH,
                        bool hasIncludeStartPoint = true,
                        bool hasIncludeFinishPoint = true) const;
//==============================================================================
  /*!
   * \brief Разбиение геодезической линии на равные сегменты, длиной не  
   *        превышающих заданную
   * \details Сначала вычисляется длина сегмента для равномерного разбиения.
   *          Может отличаться от заданной длины, но не превосходить её.
   *          Если максимальная длина сегмента меньше или равна 0, тогда 
   *          возвращается набор из двух точек: точки начала и точки завершения.
   * \param[in] maxSegmentLength - максимальная длина сегмента [м]
   *                               (должна быть больше 0).   
   * \return Последовательный набор координат точек, соответствующих разбиению 
  */ 
  virtual std::vector<GeoPoint2D> 
          divide(double maxSegmentLength = DEFAULT_MAX_SEGMENT_LENGTH) const;
//==============================================================================
  /*!
   * \brief Получить точку начала геодезической линии
   * \return Точка начала геодезической линии
  */
  virtual inline GeoPoint2D getStartPoint() const
  {
    return mStartPoint;
  }
//==============================================================================
  /*!
   * \brief Получить точку завершения геодезической линии
   * \return Точка завершения геодезической линии
  */
  virtual inline GeoPoint2D getFinishPoint() const
  {
    return mFinishPoint;
  }
//==============================================================================
  /*!
   * \brief Получить длину геодезической линии
   * \details Расстояние между точками начала и завершения геодезической линии 
   * \return Длина геодезической линии [м]
  */
  virtual inline double getLength() const
  {
    return mLength;
  }
//==============================================================================
  /*!
   * \brief Получить азимут геодезической линии от точки начала
   * \return Азимут геодезической линии от точки начала [радианы]
  */
  virtual inline Radian getAzimuthAtStart() const
  {
    return mStartAzimuth;
  }
//==============================================================================
  /*!
   * \brief Получить азимут геодезической линии от точки завершения
   * \return Азимут геодезической линии от точки завершения [радианы]
  */
  virtual inline Radian getAzimuthAtFinish() const
  {
    return mFinishAzimuth;
  }
//==============================================================================
protected:
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \details Конструктор геодезической линии должен вызываться только при 
   *          создании конкретных геодезических линий: ортодромия и локсодромия
  */
  GeodesicLine();
//==============================================================================
  GeoPoint2D mStartPoint;   //!< Точка начала
  GeoPoint2D mFinishPoint;  //!< Точка завершения
  double mLength;           //!< Длина [м]
  Radian mStartAzimuth;     //!< Азимут от точки начала [радианы]
  Radian mFinishAzimuth;    //!< Азимут от точки завершения [радианы]
//==============================================================================
};
//==============================================================================
} //! Inner
} //! Geodesic
//==============================================================================
#endif //! GEODESIC_GEOLINETOOLS_INNER_GEODESIC_LINE_HPP