#ifndef TRIANGULAR_GEOMETRY_OBJECTS_EDGE_HPP
#define TRIANGULAR_GEOMETRY_OBJECTS_EDGE_HPP
//==============================================================================
#include "Top.hpp"
#include "Triangle.hpp"
//! Geometry
#include <Geometry/Objects/BorderedLine.hpp>
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Triangle;
//==============================================================================
  /*!
  * \brief Ребро триангуляции
  * \details Имеет направление от i к j
  */
class Edge : public Link, public Geometry::BorderedLine
{
public:
//==============================================================================
  /*!
  * \brief Конструктор
  * \param[in] startTop - стартовая вершина
  * \param[in] finishTop - конечная вершина
  */
  Edge(const std::shared_ptr<Top>& startTop, 
    const std::shared_ptr<Top>& finishTop);
//==============================================================================
  /*!
  * \brief Копирующий конструктор
  * \param[in] edge - копируемое ребро
  */
  Edge(const std::shared_ptr<Edge>& edge);
//==============================================================================
  /*!
  * \brief Деструктор
  */
  ~Edge();
//==============================================================================
  /*!
  * \brief Осуществляется проверка, является ли ребро фиксированным
  * \details Проверяется, является ли ребро фиксированным или нет.
  * \ return true  - ребро является фиксированным;
  *          false - ребро не является фиксированным.
  */
  bool isBound();
//==============================================================================
  /*!
  * \brief Проверка рёбер на совпадение
  * \details Проверяется совпадение ребра с заданным. Ребро, у
  *          которого отличается только направление, считается
  *          совпавшим. При этом направление текущего ребра
  *          меняется в соответствии с ним.
  * \param[in] edge - ребро, которое проверяется на совпадение;
  * \return true  - ребра совпадают;
  * \       false - ребра не совпадают.
  */
  bool isSame(std::shared_ptr<Edge> edge);
//==============================================================================
  /*!
  * \brief Проверка рёбер на пересечение не в концевой вершине
  * \param[in] edge - ребро, с которым ищется пересечение;
  * \return true  - есть пересечение рёбер не в концевой вершине;
  * \       false - нет пересечения рёбер.
  */
  bool isIntersectEdge(std::shared_ptr<Edge> edge);
//==============================================================================
  /*!
  * \brief Проверка попадания точки на ребро без учёта граничных точек
  * \param[in] top - указатель на точку;
  * \ return true  - попадает на ребро (но не на его вершину);
  *          false - не попадает на ребро.
  */
  bool atEdge(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Определение ориентации ребра в грани
  * \details Производится определение ориентации указанного ребра
  *          в заданной грани.
  * \param[in] edge     - указатель на ребро;
  * \param[in] triangle - указатель на грань.
  * \ return true  - против часовой стрелки;
  *          false - по часовой стрелке.
  */
  static bool isCounterclockwise(
    std::shared_ptr<Edge> edge,
    std::shared_ptr<Triangle> triangle);
//==============================================================================
  /*!
  * \brief Поиск смежной грани и следующего ребра в пучке
  * \details Осуществляет поиск смежной грани указанному ребру и
  *          следующего ребра в пучке, заданного вершиной,
  *          с указанной стороны.
  * \param[in] edge             - указатель на ребро, относительно
  *                               которого осуществляется поиск;
  * \param[in] top              - указатель на вершину;
  * \param[in] position         - сторона поиска (слева или справа, если
  *                               выбрана левая сторона, поиск будет
  *                               осуществляться в направлении против часовой
  *                               стрелки от заданного ребра, если справа -
  *                               по часовой);
  * \param[out] adjacentTriangle - указатель на смежную грань;
  * \param[out] nextEdge         - указатель на следующее ребро в пучке.
  */
  static void scanBunch(
    std::shared_ptr<Edge> edge,
    std::shared_ptr<Top> top,
    Geometry::PlanePosition position,
    std::shared_ptr<Triangle>& adjacentTriangle,
    std::shared_ptr<Edge>& nextEdge);
//==============================================================================
 /*!
  * \brief Поиск соседнего ребра в пучке
  * \details Осуществляет поиск соседнего ребра в пучке, заданном вершиной,
  *          для текущего ребра.
  * \param[in] top          - указатель на вершину;
  * \param[in] findLeftEdge - если true - поиск будет осуществляться слева от
  *                           ребра, иначе - справа.
  * \return указатель на соседнее ребро.
  */
  std::shared_ptr<Edge> getNeighbour(
    std::shared_ptr<Top> top, bool findLeftEdge = true);
//==============================================================================
  /*!
  * \brief Задание стартовой вершины
  * \param[in] top - указатель на вершину
  */
  void setI(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Задание конечной вершины
  * \param[in] top - указатель на вершину
  */
  void setJ(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Получение стартовой вершины
  * \return указатель на стартовую вершину
  */
  std::shared_ptr<Top> getI();
//==============================================================================
  /*!
  * \brief Получение конечной вершины
  * \return указатель на конечную вершину
  */
  std::shared_ptr<Top> getJ();
//==============================================================================
  /*!
  * \brief Получение вершины ребра, отличающейся от заданной
  * \details Проверка принадлежности входной вершины ребру не выполняется.
  * \param[in] top - указатель на вершину;
  * \return указатель на другую вершину ребра
  */
  std::shared_ptr<Top> getOtherTop(std::shared_ptr<Top> top);
//==============================================================================
  std::shared_ptr<Triangle> left;   //!< Указатель на грань, прилегающую к ребру
  std::shared_ptr<Triangle> right;  //!< Указатель на грань, прилегающую к ребру
  bool                      fixed;  //!< Признак, фиксированности ребра  
//==============================================================================
private:
//==============================================================================
  std::shared_ptr<Top>      mI;     //!< Указатель на стартовую вершину ребра
  std::shared_ptr<Top>      mJ;     //!< Указатель на конечную вершину ребра
//==============================================================================
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_OBJECTS_EDGE_HPP