#ifndef TRIANGULAR_GEOMETRY_OBJECTS_TOP_HPP
#define TRIANGULAR_GEOMETRY_OBJECTS_TOP_HPP
//==============================================================================
#include "Edge.hpp"
//! Structure
#include "Structure/Link.hpp"
//! Point
#include <Point/Point2D.hpp>
//! Geometry
#include <Geometry/Objects/BorderedLine.hpp>
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Edge;
class Top;
//==============================================================================
  /*!
  * \brief Информация о вершине на маршруте
  */
class PathInfo
{
public:
//==============================================================================
  PathInfo()
    : distance(std::numeric_limits<double>::max())
    , prevTop(nullptr)
  { }
//==============================================================================
  ~PathInfo()
  { }
//==============================================================================
  double               distance; //!< Расстояние от начала маршрута
  std::shared_ptr<Top> prevTop;  //!< Предыдущая вершина маршрута
//==============================================================================
};
//==============================================================================
  /*!
  * \brief Значения результатов сравнения двух вершин
  */
  enum Comparison
  {
    Equally   //!< Равно
    , Larger  //!< Больше
    , Less    //!< Меньше
  };
//==============================================================================
  /*!
  * \brief Вершина для триангуляции
  */
class Top : public Point2D, public Link
{
//==============================================================================
public:
//==============================================================================
  /*!
  * \brief Конструктор
  * \param[in] x - значение координаты по оси OX
  * \param[in] y - значение координаты по оси OY
  */
  Top(double x = 0., double y = 0.);
//==============================================================================
  /*!
  * \brief Копирующий конструктор
  * \param[in] top - копируемая вершина
  */
  Top(const std::shared_ptr<Top>& top);
//==============================================================================
  /*!
  * \brief Деструктор 
  */
  ~Top();
//==============================================================================
  /*
  * \brief Сравнение текущей вершины с указанной
  * \param[in] top - указатель на вершину с которой происходит сравнение
  * \                  текущей.
  * \return Результат сравнения двух вершин.
  */
  Comparison compare(std::shared_ptr<Top> top);
//==============================================================================
  /*
  * \brief Проверка на совпадение координат текущей и указанной вершин
  * \param[in] top - указатель на вершину с которой происходит сравнение
  * \                  текущей.
  * \ \return    true  - координаты точек совпадают;
  * \            false - координаты точек не совпадают.
  */
  bool isSame(std::shared_ptr<Top> top);
//==============================================================================
  /*
  * \brief Проверка обхода указанных трех вершин по часовой стрелке
  * \param top1[in] - указатель на первую вершину;
  * \param top2[in] - указатель на вторую вершину;
  * \param top3[in] - указатель на третью вершину;
  * \return true  - по часовой стрелке;
  * \       false - против часовой стрелки.
  */
  static bool isClockwise(std::shared_ptr<Top> top1,
    std::shared_ptr<Top> top2,
    std::shared_ptr<Top> top3);
//==============================================================================
  /*
  * \brief Проверка: лежат ли вершины на одной прямой
  * \param top1[in] - указатель на первую вершину;
  * \param top2[in] - указатель на вторую вершину;
  * \param top3[in] - указатель на третью вершину;
  * \return true  - лежат;
  * \       false - не лежат.
  */
  static bool isLine(std::shared_ptr<Top> top1,
    std::shared_ptr<Top> top2,
    std::shared_ptr<Top> top3);
//==============================================================================
  /*
  * \brief Поиск фиксированного ребра для заданной вершины.
  * \param[in] direction - направление поиска фиксированного ребра
  *                        (left или right).
  * \return фиксированное ребро.
  * \throws TriangularFailure # IncorrectDirection || TopHasNoEdge ||
                                NoFixedEdge
  */
  std::shared_ptr<Edge> getFixedEdge(
    const Geometry::PlanePosition direction);
//==============================================================================
  /*
  * \brief Обновление информации о кратчайшем маршруте до текущей вершины.
  * \details Вычисляется полное расстояние до текущей вершины через сумму
  *          расстояний от начала маршрута до проверяемой предыдущей вершины
  *          (должно быть уже вычислено) и от проверяемой предыдущей вершины
  *          до текущей. Если это расстояние оказывается наименьшим из
  *          рассчитанных, текущая точка запоминает его и предыдущую точку
  *          маршрута, соответствующую рассчитанному расстоянию.
  * \param prevTop[in]    - указатель на предыдущую вершину;
  * \param curTop[in|out] - указатель на вершину, до которой прокладывается
  *                         маршрут.
  * \return true  - расстояние вычислено;
  * \       false - расстояние оказалось не оптимальным.
  */
  static bool updatePathInfo(
    std::shared_ptr<Top> prevTop,
    std::shared_ptr<Top> curTop);
//==============================================================================
  /*
  * \brief Сброс информации о вершине на маршруте
  * \details Производится сброс значений на начальные,
  *          а в случае первого обращения - инициализация
  */
  void resetInfo();
//==============================================================================
  std::shared_ptr<Edge>     edge; //!< Указатель на любое инцидентное ребро.
  uint32_t                  id;   //!< Идентификатор исходного массива.
  std::shared_ptr<PathInfo> info; //!< Информация о вершине на маршруте.
//==============================================================================
};
//==============================================================================
} //! TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_OBJECTS_TOP_HPP