#ifndef TRIANGULAR_GEOMETRY_OBJECTS_TRIANGLE_HPP
#define TRIANGULAR_GEOMETRY_OBJECTS_TRIANGLE_HPP
//==============================================================================
#include "Structure/Link.hpp"
//! Point
#include <Point/Point2D.hpp>
//! std
#include <cstdint>
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Edge;
class Top;
//==============================================================================
/*!
* \brief Положение вершины на грани
*/
enum PositionInTriangle
{
  Inside,   //!< Внутри
  AtEdge,   //!< На ребре
  AtVertex, //!< Совпадает с вершиной
  Outside   //!< Снаружи
};
//==============================================================================
  /*!
  * \brief Грань триангуляции
  */
class Triangle : public Link
{
public:
//==============================================================================
  /*!
  * \brief Конструктор
  */
  Triangle();
//==============================================================================
  /*! 
  * \brief Конструктор по трем ребрам
  * \param[in] edge1 - первое ребро
  * \param[in] edge2 - второе ребро
  * \param[in] edge3 - третье ребро
  */
  Triangle(const std::shared_ptr<Edge>& edge1,
           const std::shared_ptr<Edge>& edge2,
           const std::shared_ptr<Edge>& edge3);
//==============================================================================
  /*!
  * \brief Копирующий конструктор
  * \param[in] triangle - копируемая грань
  */
  Triangle(const std::shared_ptr<Triangle>& triangle);
//==============================================================================
  /*!
  * \brief Деструктор
  * \details Перед удалением, убираются указатели на данную грань
  * \        из ребер, которые его ограничивают.
  */
  ~Triangle();
//==============================================================================
  /*!
  * \brief Разрушение грани
  * \details Убираются указатели на данную грань из ребер,
  * \        которые его ограничивают.
  */
  void disTry();
//==============================================================================
  /*!
  * \brief Проверка на попадание вершины в описанную окружность
  * \details Проверяется, попадает ли заданная вершина в окружность,
  * \        описанную вокруг грани.
  * \param[in] top - указатель на вершину.
  * \return true  - попадает;
  * \       false - не попадает.
  */
  bool isTopInCircle(std::shared_ptr<Top> top);
//==============================================================================
/*!
* \brief Определение положения вершины относительно одного из ребёр
*         грани
* \details Проверяется, попадает ли заданная вершина по ту же сторону
*          заданного ребра грани, что и третья вершина этой грани
*          (не лежащая на выбранном ребре), по другую сторону или
*          на само ребро.
* \param[in] top - указатель на вершину, положение которой
*                  определяется;
* \param[in] edge - заданное ребро;
* \param[in] triangleTop - вершина грани, не лежащая на заданном ребре.
* \return положение вершины: на полуплоскости грани относительно
*         ребра, на ребре, на вершине ребра или за пределами
*         полуплоскости грани.
*/
  PositionInTriangle positionRelativelyTriangleSide(
    std::shared_ptr<Top> top,
    std::shared_ptr<Edge> edge,
    std::shared_ptr<Top> triangleTop);
//==============================================================================
  /*!
  * \brief Определение положения вершины на грани
  * \details Проверяется, попадает ли заданная вершина внутрь грани,
  *          на её ребро или вершину, или находится за пределами грани.
  * \param[in] top - указатель на вершину.
  * \return положение вершины относительно грани.
  */
  PositionInTriangle positionInTriangle(std::shared_ptr<Top> top);
  //==============================================================================
  /*!
  * \brief Проверка на попадание вершины на грань
  * \details Проверяется, попадает ли заданная вершина на грань
  *          (попадание на рёбра грани также считается попаданием
  *          на грань).
  * \param[in] top - указатель на вершину.
  * \return true  - попадает;
  * \       false - не попадает.
  */
  bool isTopInTriangle(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Поиск соседних граней
  * \details Ищутся все соседнии грани текущей грани.
  * \        Результаты заносятся по заданным указателям.
  * \param[out] a - указатель на соседнюю грань;
  * \param[out] b - указатель на соседнюю грань;
  * \param[out] c - указатель на соседнюю грань.
  */
  void nearTriangle(std::shared_ptr<Triangle>& a, 
                    std::shared_ptr<Triangle>& b, 
                    std::shared_ptr<Triangle>& c);
//==============================================================================
  /*!
  * \brief Проверка точки на соответствие вершине грани
  * \details Проверяется, является ли указанная вершина вершиной текущей грани.
  * \param[in] top - указатель на вершину;
  * \return true   - является вершиной грани;
  * \       false  - не является вершиной грани.
  */
  bool hasTopTriangle(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Вершина напротив ребра
  * \details Осуществляется поиск вершины, находящейся напротив указанного ребра.
  * \param[in] edge - указатель на ребро.
  * \return Указатель на вершину.
  */
  std::shared_ptr<Top> topOppositeEdge(std::shared_ptr<Edge> edge);
//==============================================================================
  /*!
  * \brief Все вершины грани
  * \details Заполняет полученые указатели вершинами грани.
  * \param[out] i - указатель на вершину;
  * \param[out] j - указатель на вершину;
  * \param[out] k - указатель на вершину.
  */
  void allTops(std::shared_ptr<Top>& i, 
                std::shared_ptr<Top>& j, 
                std::shared_ptr<Top>& k);
//==============================================================================
  /*!
  * \brief Ребро напротив вершины
  * \details Осуществляется поиск ребра, находящейся напротив указанной вершины.
  * \param[in] top - указатель на вершину.
  * \return Указатель на ребро.
  */
  std::shared_ptr<Edge> edgeOppositeTop(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Построить описывающий грань круг
  * \details Вычисляются координаты точки центра и радиус окружности,
  * \        описывающей грань.
  */
  void circle();
//==============================================================================
private:
//==============================================================================
  /*!
  * \brief Проверка, что точка лежит с правильной стороны от ребер
  * \details Проверяется, что точка лежит относительно каждого ребра с той же
  * \        стороны, что и третья вершина грани, не задействованная в ребре.
  * \param[in] top - указатель на вершину.
  * \return true  - лежит с правильной стороны от ребер;
  * \       false - не лежит с правильной стороны от ребер.
  */
  bool isConFormFixEdges(std::shared_ptr<Top> top);
//==============================================================================
public:
  std::shared_ptr<Edge> p;            //!< Указатель на ребро.
  std::shared_ptr<Edge> q;            //!< Указатель на ребро.
  std::shared_ptr<Edge> r;            //!< Указатель на ребро.
  Point2D               pCenter;      //!< Центр описанной окружности
  double                radius;       //!< Радиус описанной окружности
  bool                  finit;        //!< Признак законченности грани
  bool                  met;          //!< Признак, что грань отмечена
  uint32_t              id;           //!< Индекс грани в последовательности
  std::shared_ptr<Triangle> neighTr;  //!< Соседняя грань 
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_OBJECTS_TRIANGLE_HPP