#include <Geodesic/GeoLineTools/Inner/GeodesicLineTools.hpp>
//! gtest
#include <gtest/gtest.h>
//==============================================================================
using namespace Geodesic;
//==============================================================================
  /*!
   * Использование данного класса самостоятельно не предусмотрено, поэтому
   * тестирование данного класса осуществляется непосредственно в потомках:
   * - OrthodromyToolsTest - тесты для работы с инструментами ортодромии;
   * - LoxodromeToolsTest  - тесты для работы с инструментами локсодромии.
  */
//==============================================================================
