#include <Geodesic/GeoLineTools/Inner/GeodesicLine.hpp>
//! gtest
#include <gtest/gtest.h>
//==============================================================================
using namespace Geodesic;
//==============================================================================
  /*!
   * Использование данного класса самостоятельно не предусмотрено, поэтому
   * тестирование данного класса осуществляется непосредственно в потомках:
   * - OrthodromyTest - тесты для ортодромии;
   * - LoxodromeTest  - тесты для локсодромии.
  */
//==============================================================================
