#ifndef GEOMETRY_OPERATIONS_TRANSITION_BASES_HPP
#define GEOMETRY_OPERATIONS_TRANSITION_BASES_HPP
//==============================================================================
#include <Geometry/Objects/Basis3D.hpp>
//==============================================================================
namespace Geometry
{
//==============================================================================
class TransitionBases
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор пересчёта координат при переходе из базиса в базис
   * \details Описание алгоритма: [83т666] ... [Переход между базисами]
   * \param[in] initBasis - исходный базис
   * \param[in] goalBasis - целевой базис
  */
  TransitionBases(const Basis3D& initBasis, const Basis3D& goalBasis);
//==============================================================================
  /*!
   * \brief Прямой перевод координат точки (из исходного в целевой базис)
   * \details Если базис - не базис, возвращается подаваемая точка
   * \param[in] point - координаты точки в исходном базисе
   * \return Координаты точки в целевом базисе
  */
  Point3D forward(const Point3D& point);
//==============================================================================
  /*!
   * \brief Обратный перевод координат точки (из целевого в исходный базис)
   * \details Если базис - не базис, возвращается подаваемая точка
   * \param[in] point - координаты точки в целевом базисе
   * \return Координаты точки в исходном базисе
  */
  Point3D inverse(const Point3D& point);
//==============================================================================
  /*!
   * \brief Прямой перевод координат вектора (из исходного в целевой базис)
   * \details Если базис - не базис, возвращается подаваемый вектор
   * \param[in] vector - координаты вектора в исходном базисе
   * \return Координаты вектора в целевом базисе
  */
  Vector3D forward(const Vector3D& vector);
//==============================================================================
  /*!
   * \brief Обратный перевод координат вектора (из целевого в исходный базис)
   * \details Если базис - не базис, возвращается подаваемый вектор
   * \param[in] vector - координаты вектора в целевом базисе
   * \return Координаты вектора в исходном базисе
  */
  Vector3D inverse(const Vector3D& vector);
//==============================================================================
  /*!
   * \brief Смена базисов между которыми осуществляется переход
   * \param[in] initBasis - исходный базис
   * \param[in] goalBasis - целевой базис
  */
  void setBases(const Basis3D& initBasis, const Basis3D& goalBasis);
//==============================================================================
  /*!
   * \brief Получение исходного базиса
   * \return Исходный базис
  */
  inline Basis3D getInitBasis() const
  {
    return mInitBasis;
  }
//==============================================================================
  /*!
   * \brief Получение целевого базиса
   * \return Целевой базис
  */
  inline Basis3D getGoalBasis() const
  {
    return mGoalBasis;
  }
//==============================================================================
protected:
//==============================================================================
  /*!
   * \brief Формирование матриц перехода из базиса в базис 
  */
  void calcParams();
//==============================================================================
  Basis3D mInitBasis; //!< исходный базис
  Basis3D mGoalBasis; //!< целевой базис

  //! Матрица перехода от исходного к целевому базису, разложенная по векторам 
  //! (FTM - Forward Transition Matrix)
  Vector3D mFTMi;
  Vector3D mFTMj;
  Vector3D mFTMk;

  //! Матрица перехода от целевого к исходному базису, разложенная по векторам 
  //! (ITM - Inverse Transition Matrix)
  Vector3D mITMi;
  Vector3D mITMj;
  Vector3D mITMk;
//==============================================================================
};
//==============================================================================
} //! Geometry
//==============================================================================
#endif //! GEOMETRY_OPERATIONS_TRANSITION_BASES_HPP