#ifndef MATH_TOOLS_BASIC_MATH_CONSTANTS_HPP
#define MATH_TOOLS_BASIC_MATH_CONSTANTS_HPP
//==============================================================================
//! std
#define _USE_MATH_DEFINES
#if defined(WIN32) || defined(_WIN32)
#include <math.h> //!< для работы под Windows
#else
#include <cmath>  //!< для работы под Linux
#endif // WIN32
#include <limits>
//==============================================================================
//! Константы для оценки точности
//==============================================================================
constexpr float ACCURACY_FLOAT    //!< для вещественных чисел (4 байта)
                = std::numeric_limits<float>::epsilon() * 10;
constexpr double ACCURACY_DOUBLE  //!< для вещественных чисел (8 байт)
                 = std::numeric_limits<double>::epsilon() * 100;
constexpr double ACCURACY_DEGREE  //!< для градусов
                 = .0000001;
constexpr double ACCURACY_RADIAN  //!< для радиан
                 = .00000001;
constexpr double ACCURACY_METRE   //!< для метров
                 = 1.;
//==============================================================================

//==============================================================================
//! Константы для единиц измерения (радиан и градусов)
//==============================================================================
constexpr int DEGREE_RATIO  //!< минут в градусе и секунд в минуте
              = 60; 
constexpr int WIDE_ANGLE    //!< развёрнутый угол в градусах
              = 180;  
constexpr int PERIGON       //!< полный угол в градусах
              = 2 * WIDE_ANGLE;

constexpr double DEGREE_PER_RADIAN    //!< 1 радиан в градусах
                 = WIDE_ANGLE / M_PI;
constexpr double RADIAN_PER_DEGREE    //!< 1 градус в радианах
                 = M_PI / WIDE_ANGLE;
//==============================================================================

//==============================================================================
//! Перечисления
//==============================================================================
enum GeoCoordType //!< тип геодезической координаты (для радиан и градусов)
{
  LATITUDE  = 0,  //!< Широта     
  LONGITUDE = 1   //!< Долгота
};
//==============================================================================

//==============================================================================
#endif //! MATH_TOOLS_BASIC_MATH_CONSTANTS_HPP