#ifndef GEOMETRY_OPERATIONS_INNER_INT_CIRCLE_HPP
#define GEOMETRY_OPERATIONS_INNER_INT_CIRCLE_HPP
//==============================================================================
#include <Geometry/Objects/Circle.hpp>
//! PrimaryEntities
#include <PrimaryEntities/GeometryEntities.hpp>
//==============================================================================
namespace Geometry
{
//==============================================================================
/*!
 * \brief Круг на декартовой плоскости с целочисленным неотрицательным
 *        радиусом (в метрах).
*/
class IntCircle : public Circle
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор круга с целым неотрицательным радиусом на декартовой
   *        плоскости.
   * \param[in] center -- центр круга.
   * \param[in] radius -- целый неотрицательный радиус круга (в метрах).
  */
  inline IntCircle(const Point2D& center, unsigned int radius) noexcept 
  : Circle(center, static_cast<double>(radius))
  , mIntRadius(radius) {}
//==============================================================================
  /*!
   * \brief intRadius -- целый неотрицательный радиус круга.
   *
   * \return Целый неотрицательный радиус круга (в метрах).
  */
  inline unsigned int intRadius() const noexcept
  {
    return mIntRadius;
  }
//==============================================================================
  /*!
   * \brief setRadius -- метод, задающий для круга новую длину радиуса.
   * \details Вещественное число округляется вниз до ближайшего целого.
   *          Если результат округления отрицательный, он заменяется нулём.
   * \param[in] value -- новая длина радиуса круга (в метрах).
   *
  */
  virtual void setRadius(double value) noexcept override;
//==============================================================================
  /*!
   * \brief setRadius -- метод,
   * устанавливающий для объекта новый целый неотрицательный радиус.
   * \param[in] value -- новый целый неотрицательный радиус (в метрах).
  */
  void setRadius(unsigned int value) noexcept;
//==============================================================================
protected:
//==============================================================================
  unsigned int mIntRadius; //!< Целый неотрицательный радиус круга (в метрах).
//==============================================================================
};
//==============================================================================
} //! Geometry
//==============================================================================
#endif //! GEOMETRY_OPERATIONS_INNER_INT_CIRCLE_HPP