#ifndef MATH_TOOLS_BASIC_MATH_ANGLE_TYPES_HPP
#define MATH_TOOLS_BASIC_MATH_ANGLE_TYPES_HPP
//==============================================================================
//! AngularUnits
#include <MathTools/AngularUnits/Radian.hpp>
//==============================================================================
namespace BasicMath
{
//==============================================================================
/*!
*\brief Типы углов
*/
enum AngleType
{
  ArbitraryAngle, // произвольный угол
  ZeroAngle, // угол близок к 0
  StraightAngle // угол близок к развернутому
};
//==============================================================================
/*!
*\brief Определение типа угла с корректировкой значений
*\details на вход должны поступать углы в диапазоне ( -pi - eps, pi + eps ).
*         Углы, близкие к 0 и pi приводятся к соответствующим значениям
*\param[in|out] - исследуемый угол [радианы]
*\return тип угла
*/
AngleType checkAndCorrectAngle( Radian& angle );
//==============================================================================
} //! BasicMath
//==============================================================================
#endif //! MATH_TOOLS_BASIC_MATH_ANGLE_TYPES_HPP