#ifndef MATH_TOOLS_BASIC_MATH_SIGN_OPERATIONS_HPP
#define MATH_TOOLS_BASIC_MATH_SIGN_OPERATIONS_HPP
//==============================================================================
namespace BasicMath
{
//==============================================================================
  /*
   * \brief Определение знака значения 
   * \details Определяет положительное число или отрицательное.
   *          0 относится к положительным числам.
   * \param[in] value - значение, чей знак определяется 
   * \return  1 - для положительных значений
   *         -1 - для отрицательных значений
  */
  template<class Number>
  inline int signum(const Number& value)
  {
    if (value < Number(0))
      return -1;
    return 1;
  }
//==============================================================================
  /*
   * \brief Определение знака значения (математический signum)
   * \details Определяет положительное число или отрицательное.
   *          0 - это 0.
   * \param[in] value - значение, чей знак определяется 
   * \return  1 - для положительных значений
   *          0 - для 0;
   *         -1 - для отрицательных значений
  */
  template<class Number>
  inline int sign(const Number& value)
  {
    return (Number(0) < value) - (value < Number(0));
  }
//==============================================================================
}
//==============================================================================
#endif //! MATH_TOOLS_BASIC_MATH_SIGN_OPERATIONS_HPP
