#ifndef OS_CREATE_DIRECTORY_HPP
#define OS_CREATE_DIRECTORY_HPP
//==============================================================================
//! std
#include <string>
//==============================================================================
namespace OS
{
//==============================================================================
/*!
 * \brief createDirectory -- функция, создающая внутри определённой директории
 * новую директорию с заданным именем.
 *
 * \param[in] sourceDirectory -- путь директории,
 * в которой осуществляется создание другой директории.
 *
 * \param[in] directoryToCreateName -- имя создаваемой директории
 * (без символов типа '/').
 *
 * \return -- true, если директория была успешно создана;
 *            false -- иначе.
 *
 * \warning Директория,
 * внутри которой создаётся новая директория,
 * должна уже существовать!
 */
bool
createDirectory(
  const std::string& sourceDirectory,
  const std::string& directoryToCreateName) noexcept;
//==============================================================================
} //! OS
//==============================================================================
#endif //! OS_CREATE_DIRECTORY_HPP