#ifndef OS_DELETE_DIRECTORY_HPP
#define OS_DELETE_DIRECTORY_HPP
//==============================================================================
//! std
#include <string>
//==============================================================================
namespace OS
{
//==============================================================================
/*!
 * \brief deleteDirectory -- функция, удаляющая внутри определённой директории
 * другую директорию с заданным именем.
 *
 * \param[in] sourceDirectory -- путь директории,
 * в которой осуществляется удаление другой директории.
 *
 * \param[in] directoryToDeleteName -- имя удаляемой директории
 * (без символов типа '/').
 *
 * \return -- true, если директория была успешно удалена;
 *            false -- иначе.
 *
 * \warning Директория,
 * внутри которой удаляется другая директория,
 * должна существовать!
 */
bool
deleteDirectory(
  const std::string& sourceDirectory,
  const std::string& directoryToDeleteName) noexcept;
//==============================================================================
} //! OS
//==============================================================================
#endif //! OS_DELETE_DIRECTORY_HPP