#ifndef OS_DELETE_FILE_HPP
#define OS_DELETE_FILE_HPP
//==============================================================================
//! std
#include <string>
//==============================================================================
namespace OS
{
//==============================================================================
/*!
 * \brief Удаление файла
 * \details Предварительно осуществляется проверка на наличие файла и доступа к 
 *          нему.
 * \param[in] fileName - полное имя удаляемого файла
*/
void deleteFile(const std::string& fileName) noexcept;
//==============================================================================
/*!
 * \brief Удаление файла с расширением ".shp"
 * \details Предварительно осуществляется проверка на наличие файла и доступа к 
 *          нему.
 *          Если удаляемый файл действительно имеет расширение ".shp", то 
 *          дополнительно удаляются одноименные файлы с расширениями ".dbf", 
 *          ".prj", ".shx",
 *          если нет, то удаляется только сам файл.
 * \param[in] fileName - полное имя удаляемого файла
*/
void
deleteShpFile(const std::string& fileName) noexcept;
//==============================================================================
} //! OS
//==============================================================================
#endif //! OS_DELETE_FILE_HPP