#ifndef OS_EXPAND_ENVIRONMENT_VARIABLES_HPP
#define OS_EXPAND_ENVIRONMENT_VARIABLES_HPP
//==============================================================================
#if defined(_WIN64) || defined(_WIN32)
//! std
#include <windows.h>
#include <processenv.h>
#include <string>
//==============================================================================
namespace OS
{
//==============================================================================
/*!
  * \brief expandEnvironmentVariables -- функция,
  * декодирующая переменные среды Windows в строке.
  *
  * \param[in] rawPath -- строка,
  * в которой необходимо произвести декодирование переменных среды Windows.
  *
  * \return строка с декодированными переменными среды Windows.
  */
std::string expandEnvironmentVariables(const std::string& rawPath) noexcept;
//==============================================================================
}
//==============================================================================
#endif
//==============================================================================
#endif //! OS_EXPAND_ENVIRONMENT_VARIABLES_HPP
//==============================================================================