#ifndef OS_FIND_FILES_HPP
#define OS_FIND_FILES_HPP
//==============================================================================
//! std
#include <string>
#include <forward_list>
//==============================================================================
namespace OS
{
//==============================================================================
/*!
 * \brief findFiles -- функция, возвращающая для директории
 * список путей всех файлов, лежащих непосредственно в ней
 * и имеющих указанное в параметре окончание имени.
 *
 * \param[in] directory -- путь директории.
 *
 * \param[in] ending -- строка,
 * которой должны заканчиваться имена искомых файлов.
 *
 * \return -- список путей до искомых файлов,
 * где имена файлов соединены с исходным путём директории.
 *
 * \throws OSFailure # CouldNotOpenDirectory
 *         OSFailure # UnrecognizedFileSystemError
 */
std::forward_list<std::string>
findFiles(const std::string& directory, const std::string& ending = "");
//==============================================================================
/*!
 *\ brief Проверка на существование и доступность файла по указанному пути
 *\ param[in] fileName - полное имя файла
 *\ return true - файл существует и доступен
 *       false - файл отсутствует или недоступен
*/
bool isFileExists(const std::string& fileName);
//==============================================================================
} //! OS
//==============================================================================
#endif //! OS_FIND_FILES_HPP