#ifndef OS_NAME_HPP
#define OS_NAME_HPP
//==============================================================================
//! std
#include <string>
//==============================================================================
namespace OS
{
//==============================================================================
/*!
  * \brief getEntityName -- функция,
  * возвращающая для строки,
  * содержащей путь сущности (например, файла или директории),
  * имя этой сущности.
  *
  * \details примеры:
  * "C:\\Users\\CrocodileGena\\Documents\\\\\\important\\" -> "important"
  * "./bin//modules/useless_module/very_useless_module.txt"
  * -> "very_useless_module.txt"
  *
  * \param[in] path -- путь сущности, имя которой нужны вычислить.
  *
  * \return -- имя директории.
  */
std::string getEntityName(const std::string& path) noexcept;
//==============================================================================
} //! OS
//==============================================================================
#endif //! OS_NAME_HPP