#ifndef OS_EXCEPTION_HPP
#define OS_EXCEPTION_HPP
//==============================================================================
//! ExceptionTools
#include <ExceptionTools/ExceptionTools.hpp>
//==============================================================================
using namespace ExceptionTools;
//==============================================================================
/*!
 *\brief Именованные коды генерируемых исключений
 */
enum OSEnumFailure
{
  //!< Не удалось открыть директорию
  CouldNotOpenDirectory = SpecialFailure,
  //!< Нераспознанная ошибка при работе с файловой системой
  UnrecognizedFileSystemError
};
//==============================================================================
//! Название библиотеки для исключений
const std::string OS_LIB_TITLE = "OSTools";
//==============================================================================
/*!
 * \brief Класс формирования исключений библиотеки OSTools
 */
class OSFailure : public ExceptionTools::Failure
{
//==============================================================================
public:
  /*!
   * \brief Создание исключения.
   * \details Требуется код, остальные параметры подставятся автоматически
   * \param[in] failureId - именованный код исключения
   * \param[in] postfix - текст уточняющий/дополняющий исключение
   *                      (может использоваться для передачи текста исходного
   *                       исключения)
   * \param[in] prefix - текст, локализующий место возникновения исключения
   *                     (может использоваться для указания имени функции,
   *                      в которой локализовано исключение - трассировка
   *                      исключения)
   */
  explicit OSFailure(const unsigned int failureId,
    const std::string& postfix = "",
    const std::string& prefix = "") noexcept;
};
//==============================================================================
#endif //! OS_EXCEPTION_HPP