#ifndef GEODESIC_GEODESIC_CARTESIAN_TRANSITION_TRANSITION_HPP
#define GEODESIC_GEODESIC_CARTESIAN_TRANSITION_TRANSITION_HPP
//==============================================================================
#include <Geodesic/Helper/Ellipsoid.hpp>
//! Point
#include <Point/GeoPoint3D.hpp>
#include <Point/Point3D.hpp>
//! std
#include <memory>
//==============================================================================
namespace Geodesic
{
//==============================================================================
/*!
 * \brief Переход между система пространственных координат
 *        На текущий момент реализован переход между геодезическими координатами
 *        (B, L, H) к пространственным декартовым координатам (x, y, z).
 *        При этом используются параметры эллипсоида на котором заданы 
 *        геодезические координаты.
*/
class Transition
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \details Если эллипсоид не задан (пустой указатель), то собирается 
   *          эллипсоид WGS-84
   * \param[in] ellipsoid - эллипсоид, на котором производится переход между
   *                        системами пространственных координат  
   * \param[in] limit - допуск для прекращения итеративных процессов
  */
  Transition(const std::shared_ptr<Ellipsoid>& ellipsoid,
             const double limit = ACCURACY_DOUBLE);
//==============================================================================
  /*!
   * \brief Переход от геодезических (B, L, H) координат к декартовым (x, y, z)
   *        Используются формулы из ГОСТ 32453-2017
   * \param[in] geoPoint - геодезические координаты точки (B, L, H)  
   * \return Декартовые координаты точки (x, y, z)
  */
  Point3D fromGeodesicToCartesian(const GeoPoint3D& geoPoint);
//==============================================================================
  /*!
   * \brief Переход от декартовых (x, y, z) координат к геодезическим (B, L, H)
   *        Используются формулы из ГОСТ 32453-2017
   * \param[in] point - декартовые координаты точки (x, y, z)  
   * \return Геодезические координаты точки (B, L, H)
  */
  GeoPoint3D fromCartesianToGeodesic(const Point3D& point);
//==============================================================================
  /*!
   * \brief Получение эллипсоида, на котором производится переход между
   *        системами пространственных координат
   * return Эллипсоид, на котором производится переход между системами
   *        пространственных координат
  */
  inline std::shared_ptr<Ellipsoid> getEllipsoid() const
  {
    return mEllipsoid;
  }
//==============================================================================
private:
//==============================================================================
  std::shared_ptr<Ellipsoid> mEllipsoid; //!< эллипсоид
  double mLimit; //!< допуск для прекращения итеративных процессов
//==============================================================================
};
//==============================================================================
} //! Geodesic
//==============================================================================
#endif //! GEODESIC_GEODESIC_CARTESIAN_TRANSITION_TRANSITION_HPP