#ifndef GEODESIC_DATUM_TRANSFORM_CONSTANTS_HPP
#define GEODESIC_DATUM_TRANSFORM_CONSTANTS_HPP
//==============================================================================
namespace Geodesic
{
//==============================================================================
/*!
 * \brief Перечень систем координат
*/
enum CoordinateSystems
{
  CS_WGS_84    = 0, //!< WGS 84
  CS_SK_42     = 1, //!< СК-42
  CS_PZ_90_11  = 2, //!< ПЗ-90.11
  CS_PZ_90_02  = 3  //!< ПЗ-90.02
};
//==============================================================================
}
//==============================================================================
#endif //! GEODESIC_DATUM_TRANSFORM_CONSTANTS_HPP