#ifndef MATH_TOOLS_ANGULAR_UNITS_DEGREE_HPP
#define MATH_TOOLS_ANGULAR_UNITS_DEGREE_HPP
//==============================================================================
//! GeoCoordType 
#include <MathTools/Constants.hpp>
//! std
#include <string>
//==============================================================================
class Radian;
//==============================================================================
/*!
 * \brief Размерная величина (угла) - градус 
*/
class Degree
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса через величину в градусах 
   * \param[in] degrees - значение величины в градусах
  */
  explicit Degree(const double degrees = 0.);
//==============================================================================
  /*!
   * \brief Конструктор класса через значение величины в радианах
   * \param[in] radians - значение величины в радианах (через класс Radian)
  */
  explicit Degree(const Radian& radians);
//==============================================================================
  /*!
  * \brief Получение значения угла в градусах
  * \return Значение угла в градусах
  */
  inline double get() const
  {
    return mValue;
  }
//==============================================================================
  /*!
   * \brief Задание нового значения величины в градусах
   * \param[in] degrees - значение величины в градусах
  */
  inline void set(const double degrees)
  {
    mValue = degrees;
  }
//==============================================================================
  /*!
   * \brief Преобразование величины из градусов в радианы
   * \return Значение в радианах
  */
  Radian toRadians() const;
//==============================================================================
  /*!
  * \brief Задание новой величины из значения в радианах
  * \param[in] radians - значение в радианах
  */
  void fromRadians(const Radian& radians);
//==============================================================================
  /*!
  * \brief Преобразование величины в градусах в строку вида:
  *        - ГГ°ММ'СС.СС"Ш.Ш. - для широты,
  *        - ГГГ°ММ'СС.СС"Д.Д. - для долготы.
  * \param[in] geoCordType - тип геодезической координаты (широта или долгота)
  * \param[in] digitDepth - количество разрядов дробной части для секунд
  * \param[in] decimalDelimiter - символ-разделитель вещественного числа
  * \result Строка с преобразованной величиной градусов
  */
  std::string toDegreesString(const GeoCoordType geoCordType,
                              const unsigned int digitDepth = 2,
                              const std::string& decimalDelimiter = ".") const;
//==============================================================================
  /*!
   * \brief Задание новой величины из строки вида:
   *        - ГГ°ММ'СС.СС"Ш.Ш. - для широты,
   *        - ГГГ°ММ'СС.СС"Д.Д. - для долготы.
   * \param[in] degreeString - величина в градусах в форме cтроки
   * \param[in] needCheck - флаг проверки на корректность конвертирования
   * \return true  - новое значение успешно присвоено;
   *         false - новое значение не присвоено: некорректная строка
  */
  bool fromDegreesString(const std::string& degreeString, 
                         bool needCheck = false);
//==============================================================================
  /*!
  * \brief Приведение значения градусов в диапазон значений от -180 до 180
  * \return Приведённое в диапазон значение градусов
  */
  Degree normalize( ) const;
//==============================================================================
  /*!
  * \brief Приведение значения градусов в диапазон значений от 0 до 360
  * \return Приведённое в диапазон значение градусов
  */
  Degree normalizeWithShift( ) const;
//==============================================================================
  /*!
   * \brief Формирование противоположного по знаку значения (унарный минус)
   * \return Противоположное по знаку значение в градусах
   */
  inline Degree operator - () const
  {
    return Degree(-mValue);
  }
//==============================================================================
  /*!
   * \brief Увеличение значения числа в градусах на задаваемую величину
   * \param[in] degree - значение, на которое требуется увеличить текущее
   *                     значение, в градусах
   */
  Degree& operator += (const Degree& degree) noexcept;
//==============================================================================
  /*!
   * \brief Уменьшение значения числа в градусах на задаваемую величину
   * \param[in] degree - значение, на которое требуется уменьшить текущее
   *                     значение, в градусах
   */
  Degree& operator -= (const Degree& degree) noexcept;
//==============================================================================
  /*!
   * \brief Умножение значения числа в градусах на задаваемую величину
   * \param[in] degree - значение, на которое требуется умножить текущее
   *                     значение, в градусах
   */
  Degree& operator *= (const Degree& degree) noexcept;
//==============================================================================
  /*!
   * \brief Деление значения числа в градусах на задаваемую величину
   * \detail При попытке деления на нуль значение остается без изменений.
   * \param[in] degree - значение, на которое требуется поделить текущее
   *                     значение, в градусах
   * \throws MathFailure # DegreeDivideByZero
   */
  Degree& operator /= (const Degree& degree);
//==============================================================================
  /*!
   * \brief Сложение двух чисел в градусах
   * \param[in] degree - значение, которое требуется прибавить к текущему [°]
   * \return полученная сумма [°]
   */
  inline Degree operator + (const Degree& degree) const
  {
    return Degree(mValue + degree.get());
  }
//==============================================================================
  /*!
   * \brief Вычитание двух чисел в градусах
   * \param[in] degree - значение, которое требуется вычесть из текущего [°]
   * \return полученная разность [°]
   */
  inline Degree operator - (const Degree& degree) const
  {
    return Degree(mValue - degree.get());
  }
//==============================================================================
  /*!
   * \brief Умножение двух чисел в градусах
   * \param[in] degree - значение, на которое требуется умножить текущее [°]
   * \return полученное произведение [°]
   */
  inline Degree operator * (const Degree& degree) const
  {
    return Degree(mValue * degree.get());
  }
//==============================================================================
  /*!
   * \brief Деление двух чисел в градусах
   * \param[in] degree - значение, на которое требуется разделить текущее [°]
   * \return полученное частное [°]
   * \throws MathFailure # DegreeDivideByZero
   */
  Degree operator / (const Degree& degree) const;
//==============================================================================
private:
//==============================================================================
  double mValue; //!< Значение угла в градусах 
};
//==============================================================================
#include <MathTools/AngularUnits/DegreesOperations.hpp>
//==============================================================================
#endif //! MATH_TOOLS_ANGULAR_UNITS_DEGREE_HPP