#ifndef MATH_TOOLS_ANGULAR_UNITS_RADIAN_HPP
#define MATH_TOOLS_ANGULAR_UNITS_RADIAN_HPP
//==============================================================================
//! Constants 
#include <MathTools/Constants.hpp>
//! std
#include <string>
//==============================================================================
class Degree;
//==============================================================================
/*!
 * \brief Размерная величина (угла) - радианы
*/
class Radian
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса через величину в радианах
   * \param[in] radians - числовое значение в радианах
  */
  explicit Radian(const double radians = 0.);
//==============================================================================
  /*!
   * \brief Конструктор класса через значение величины в градусах
   * \param[in] degrees - значение величины в градусах (через класс Degree)
  */
  explicit Radian(const Degree& degrees);
//==============================================================================
  /*!
   * \brief Получение значения угла в радианах
   * \return Значение угла в радианах
  */
  inline double get() const
  {
    return mValue;
  }
//==============================================================================
  /*!
   * \brief Задание нового значения величины в радианах
   * \para[in] radians - значение величины в радианах
  */
  inline void set(const double radians)
  {
    mValue = radians;
  }
//==============================================================================
  /*!
   * \brief Преобразование величины из радиан в градусы
   * \return Значение в градусах
  */
  Degree toDegrees() const;
//==============================================================================
  /*!
   * \brief Получение значения из объекта класса градусы
   * \param[in] degrees Объект класса градусы
  */
  void fromDegrees(const Degree& degrees);
//==============================================================================
  /*!
   * \brief Преобразование величины в радианах в строку вида:
   *        - ГГ°ММ'СС.СС"Ш.Ш. - для широты,
   *        - ГГГ°ММ'СС.СС"Д.Д. - для долготы.
   * \param[in] geoCordType - тип геодезической координаты (широта или долгота)
   * \param[in] digitDepth - количество разрядов дробной части для секунд
   * \param[in] decimalDelimiter - символ-разделитель вещественного числа
   * \return Строка с преобразованной величиной градусов
  */
  std::string toDegreesString(const GeoCoordType geoCordType,
                              const unsigned int digitDepth = 2,
                              const std::string& decimalDelimiter = ".") const;
//==============================================================================
  /*!
   * \brief Задание новой величины из строки вида:
   *        - ГГ°ММ'СС.СС"Ш.Ш. - для широты,
   *        - ГГГ°ММ'СС.СС"Д.Д. - для долготы.
   * \param[in] degreeString - величина в градусах в форме cтроки
   * \param[in] needCheck - флаг проверки на корректность конвертирования
   * \return true  - новое значение успешно присвоено;
   *         false - новое значение не присвоено: некорректная строка
  */
  bool fromDegreesString(const std::string& degreeString,
                         bool needCheck = false);
//==============================================================================
  /*!
   * \brief Приведение значения радиан в диапазон значений от -PI до PI
   * \return Приведённое в диапазон значение радиан
  */
  Radian normalize() const;
//==============================================================================
  /*!
   * \brief Приведение значения радиан в диапазон значений от 0 до 2*PI
   * \return Приведённое в диапазон значение радиан
  */
  Radian normalizeWithShift() const;
//==============================================================================
  /*!
   * \brief Формирование противоположного по знаку значения (унарный минус)
   * \return Противоположное по знаку значение в радианах
  */
  inline Radian operator - () const
  {
    return Radian(-mValue);
  }
//==============================================================================
  /*!
   * \brief Увеличение значения радиан на задаваемую величину
   * \param[in] radian - значение, на которое требуется увеличить текущее 
   *                     значение, в радианах
  */
  Radian& operator += (const Radian& radian) noexcept;
//==============================================================================
  /*!
   * \brief Уменьшение значения радиан на задаваемую величину
   * \param[in] radian - значение, на которое требуется уменьшить текущее 
   *                     значение, в радианах
  */
  Radian& operator -= (const Radian& radian) noexcept;
//==============================================================================
  /*!
   * \brief Умножение значения радиан на задаваемую величину
   * \param[in] radian - значение, на которое требуется умножить текущее 
   *                     значение, в радианах
  */
  Radian& operator *= (const Radian& radian) noexcept;
//==============================================================================
  /*!
   * \brief Деление значения радиан на задаваемую величину
   * \detail При попытке деления на нуль значение остается без изменений.
   * \param[in] radian - значение, на которое требуется поделить текущее
   *                     значение, в радианах
   * \throws MathFailure # RadianDivideByZero
   */
  Radian& operator /= ( const Radian& radian );
//==============================================================================
  /*!
   * \brief Сложение двух радиан
   * \param[in] radian - значение, которое требуется прибавить к текущему [рад]
   * \return полученная сумма [рад]
  */
  inline Radian operator + (const Radian& radian) const
  {
    return Radian( mValue + radian.get() );
  }
//==============================================================================
  /*!
   * \brief Вычитание двух радиан
   * \param[in] radian - значение, которое требуется вычесть из текущего [рад]
   * \return полученная разность [рад]
   */
  inline Radian operator - (const Radian& radian) const
  {
    return Radian( mValue - radian.get() );
  }
//==============================================================================
  /*!
   * \brief Умножение двух радиан
   * \param[in] radian - значение, на которое требуется умножить текущее [рад]
   * \return полученное произведение [рад]
   */
  inline Radian operator * (const Radian& radian) const
  {
    return Radian( mValue * radian.get() );
  }
//==============================================================================
  /*!
   * \brief Деление двух радиан
   * \param[in] radian - значение, на которое требуется разделить текущее [рад]
   * \return полученное частное [рад]
   * \throws MathFailure # RadianDivideByZero
   */
  Radian operator / ( const Radian& radian ) const;
//==============================================================================
//==============================================================================
private:
//==============================================================================
  double mValue; //!< Значение угла в радианах 
//==============================================================================
};
//==============================================================================
#include <MathTools/AngularUnits/RadiansOperations.hpp>
//==============================================================================
#endif //! MATH_TOOLS_ANGULAR_UNITS_RADIAN_HPP 