#ifndef GEODESIC_PROJECTION_ORTHOGRAPHIC_ORTHOGRAPHIC_INNER_HPP
#define GEODESIC_PROJECTION_ORTHOGRAPHIC_ORTHOGRAPHIC_INNER_HPP
//==============================================================================
//! Geodesic
#include <Geodesic/Helper/Ellipsoid.hpp>
//! Point
#include <Point/Point3D.hpp>
#include <Point/GeoPoint3D.hpp>
//! std
#include <memory>
//==============================================================================
namespace Geometry
{
  class Basis3D; //!< Базис
}
//==============================================================================
namespace Geodesic
{
//==============================================================================
  class Ellipsoid;  //!< Эллипсоид
  class Transition; //!< Перевод координат между геодезическими и декартовыми  
//==============================================================================
/*!
 * \brief Класс алгоритмический функционал расчёта ортографической проекции
*/
class OrthographicInner
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \details Если эллипсоид не задан (пустой указатель), то собирается
   *          эллипсоид WGS-84
   * \param[in] ellipsoid - эллипсоид в котором задаются геодезические 
   *                        координаты
   * \param[in] center - точка приложения (центр области) проекции
   * \param[in] azimuth - азимут направления оси Y системы координат проекции
   *                      [радианы]
  */
  OrthographicInner(
            const std::shared_ptr<Ellipsoid>& ellipsoid 
                                         = std::make_shared<Ellipsoid>(EL_WGS_84),
            const GeoPoint3D& center = GeoPoint3D(Radian(0.), Radian(0.), 0.f),
            const Radian& azimuth = Radian(0.));
//==============================================================================
  /*!
   * \brief Задание центра проекции
   * \param[in] center - точка приложения (центр области) проекции
   * \param[in] azimuth - азимут направления оси Y системы координат проекции
   *                      [радианы]
  */
  void setProjectionPoint(const GeoPoint3D center, 
                          const Radian azimuth = Radian(0.));
//==============================================================================
  /*!
   * \brief Задание эллипсоида задания геодезических координат
   * \param[in] ellipsoid - эллипсоид в котором задаются геодезические
   *                        координаты
   * return Признак успешности перестроения проекции:
   *        true  - проекция перестроена;
   *        false - проекция не перестроена.          
  */
  bool setEllipsoid(const std::shared_ptr<Ellipsoid>& ellipsoid);
//==============================================================================
  /*!
   * \brief Перевод точки в проекцию (из геодезических в декартовы координаты)
   * \param[in] geoPoint - геодезические координаты точки
   * \return Декартовы координаты точки в проекции
  */
  Point3D toProjection(const GeoPoint3D& geoPoint) const;
//==============================================================================
  /*!
   * \brief Перевод точки из проекции (из декартовых в геодезические координаты)
   * \param[in] point - декартовы координаты точки
   * \parma[out] visibleGeoPoint   - геодезические координаты точки,
   *                                 соответствующие видимой стороне проекции
   * \parma[out] invisibleGeoPoint - геодезические координаты точки, 
   *                                 соответствующие невидимой стороне проекции
   * \param[in] hasOnlyVisible - признак вычисления только геодезических 
   *                             координат точки, соответствующих видимой 
   *                             стороне проекции
   * \return Флаг успешности перевода:
   *                                   true  - перевод вполнен;
   *                                   false - перевод не выполнен.
  */
  bool fromProjection(const Point3D& point, 
                      GeoPoint3D& visibleGeoPoint,
                      GeoPoint3D& invisibleGeoPoint,
                      const bool hasOnlyVisible = true) 
  const;
//==============================================================================
  /*!
   * \brief Получение эллипсоида задания геодезических координат
   * return Эллипсоид в котором задаются геодезические координаты
  */
  inline std::shared_ptr<Ellipsoid> getEllipsoid() const
  {
    return mEllipsoid;
  }
//==============================================================================
  /*!
   * \brief Получение центра проекции
   * return Точка приложения (центр области) проекции
  */
  inline GeoPoint3D getCenterProjection() const
  {
    return mCenter;
  }
//==============================================================================
  /*!
   * \brief Получение азимута направления оси Y системы координат проекции
   * return Азимут направления оси Y системы координат проекции [радианы]
  */
  inline Radian getAzimuth() const
  {
    return mAzimuth;
  }
//==============================================================================
protected:
//==============================================================================
  //! Эллипсоид задания геодезических координат
  std::shared_ptr<Ellipsoid> mEllipsoid;  
  //! Перевод координат между геодезическими и декартовыми
  std::shared_ptr<Transition> mTransition;
  //! Локальный базис проекции                                           
  std::shared_ptr<Geometry::Basis3D> mBasis;
  
  GeoPoint3D mCenter;   //!< точка приложения (центр области) проекции
  Radian     mAzimuth;  //!< азимут направления оси Y системы координат проекции

  //! Вспомогательные параметры для перевода в геодезические координаты
  //! Пусть глобальный базис - (x, y, z), 
  //!       локальный базис  - (i, j, k).

  //! Основные:
  double mTgZKxz; //!< tg угла между осью OZ и проекцией k на плоскость xz 
  double mTgZKxy; //!< tg угла между осью OZ и проекцией k на плоскость yz
  double mTgZK;   //!< сумма (квадрата tg угла между z и k) и 
                  //!  (соотношения квадратов длин большой и малой полуоси 
                  //!   эллипсоида: a^2 / b^2)    

  //! Резервные (если основные нельзя рассчитать)
  double mTgYX;   //!< tg угла между осью OX и проекцией k на плоскость xy
                  //!  (соотношение компонентов y и х орта k)
  double mCosYX;  //!< величина обратная квадрату косинуса угла между y и x
//==============================================================================
};
//==============================================================================
} //! Geodesic
//==============================================================================
#endif //! GEODESIC_PROJECTION_ORTHOGRAPHIC_ORTHOGRAPHIC_INNER_HPP