#ifndef TRIANGULAR_GEOMETRY_TRIANGULATION_AREA_HPP
#define TRIANGULAR_GEOMETRY_TRIANGULATION_AREA_HPP
//==============================================================================
//! std
#include <deque>
#include <cstdint>
#include <memory>
#include <vector>
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Delauney;
class Top;
class Triangle;
//==============================================================================
  /*
  * \brief Область триангуляции (внутренняя реализация) 
  */
class Area
{
public: 
//==============================================================================
  /*
  //! \brief Конструктор 
  //!
  * \param[in] exponenta - количество значащих знаков после запятой
  */
  Area(int exponenta = 0);
//==============================================================================
  /* 
  //! \brief Деструктор
  */  
  ~Area();
//==============================================================================
  /*
  * \brief Очистка последовательности вершин
  */
  void clearTops();
//==============================================================================
  /*
  * \brief Добавление фиксированных границ контура
  * \param[in] first            - индекс первой вершины границы
  * \param[in] last             - индекс последней вершины границы
  */
  void insertFixitPolygon(uint32_t first, uint32_t last);
//==============================================================================
  /* 
  * \brief Выполнение триангуляции
  */
  void makeTriangulation();
//==============================================================================
  /*
  * \brief Расчистка триангуляции внутри дыр
  * \param[in] startHoles - индексы первых вершин границ
  */
  void clearingTriangulation(const std::vector<uint32_t>& startHoles);
//==============================================================================
  /*
  * \brief Добавление точки в последовательность вершин
  * \param[in] x - координата точки по оси OX
  * \param[in] y - координата точки по оси OY
  */
  void insertTop(double x, double y);
//==============================================================================
  /*
  * \brief Формирование вектора из последовательно записанных вершин 
  *        всех треугольников 
  * \return Массив последовательно записанных вершин всех треугольников:
  * \       <в1т1, в2т1, в3т1, в1т2, в2т2, в3т2, ..., в1тN, в2тN, в3тN>.
  * \       Все треугольники записаны по часовой стрелке.
  */
  std::vector<uint32_t> trianglesVerties();
//==============================================================================
  /*
  * \brief Задание в качестве инцидентного ребра всем вершинам фиксированного 
  *        ребра
  */
  void setFixedEdgesToTops();
//==============================================================================
private:
//==============================================================================
  /*
  * \brief Добавление соседних граней в список
  * \param[in]  tr      - указатель на грань, чьих соседей надо добавить;
  * \param[out] listTrs - список соседей для добавления.
  * \return Количество добавленных соседних граней.
  */
  uint32_t addNeighboursInList(std::shared_ptr<Triangle> tr,
                               std::deque<std::shared_ptr<Triangle>>& listTrs);
//==============================================================================
  /*
  * \brief Добавление точки в полигон
  * \param[in]  top     - индекс добавляемой вершины;
  * \param[out] contour - полигон для добавления;
  * \param[in]  top1    - индекс вершины после которой добавлять;
  * \param[in]  top2    - индекс вершины перед которой добавлять.
  * \return Количество добавленных соседних граней.
  */
  void 
  insertTopInSet(
    uint32_t top, std::deque<uint32_t>& contour, uint32_t top1, uint32_t top2);
//==============================================================================
public:
//==============================================================================
  std::deque<std::shared_ptr<Top>>  tops;         //!< набор всех вершин
  std::unique_ptr<Delauney>         delauney;     //!< триангуляция Делоне
//==============================================================================
private:
//==============================================================================
  int                               mExponenta;   //!< количество значащих 
                                                  //!  знаков после запятой
  uint32_t                          mLastPointId; //!< индекс последней вершины 
                                                  //!  в общем массиве
  uint32_t                          mLastIndex;   //!< индекс последней вершины 
                                                  //!  в полигоне
//==============================================================================
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_TRIANGULATION_AREA_HPP