#ifndef TRIANGULAR_GEOMETRY_TRIANGULATION_DELAUNEY_HPP
#define TRIANGULAR_GEOMETRY_TRIANGULATION_DELAUNEY_HPP
//==============================================================================
//! std
#include <deque>
#include <memory>
#include <vector>
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Edge;
class Head;
class Top;
class Triangle;
//==============================================================================
  /*!
  * \brief Триангуляция Делоне с ограничениями
  */
class Delauney
{
public:
//==============================================================================
  /*!
  * \brief Конструктор  
  */
  Delauney();
//==============================================================================
  /*! 
  * \brief Деструктор
  */
  ~Delauney();
//==============================================================================
  /*!
  * \brief Триангуляция Делоне для набора точек
  * \param[in] tops - вершины, на которых должна быть построена триангуляция
  */
  void triangulate(std::deque<std::shared_ptr<Top>>& tops);
//==============================================================================
  /*!
  * \brief Расчистка
  * \details Выполняется удаление плохих ребер и граней из триангуляции.
  * \        К плохим относятся ребра и грани, в состав которых входит вершина
  * \        соответствующая точке бесконечности, а так же те, что находятся
  * \        во внутренних контурах.
  * \param[in] polygons - полигоны, внутри которых необходимо выполнить 
  * \                     расчистку (задаются, одним ребром в виде двух 
  * \                     вершин, слева от которого и будет производится
  * \                     расчистка
  */
  void clearingBadEdges(const std::vector<std::pair<std::shared_ptr<Top>,
                                                    std::shared_ptr<Top>>>&
                        polygons);
//==============================================================================
  /*!
  * \brief Добавление фиксированного ребра 
  * \details Производится добавление фиксированного ребра,
  * \        заданного двумя вершинами.
  * \param[in] point1           - указатель на одну вершину ребра.
  * \param[in] point2           - указатель на другую вершину ребра.
  */
  void addFixedEdge(std::shared_ptr<Top> point1, std::shared_ptr<Top> point2);
//==============================================================================
protected:
//==============================================================================
  /*! 
  * \brief Коррекция согласованности ребер и граней
  * \details Проверяется согласованность ребер и граней и вносятся коррективы,
  * \        если есть рассогласованность.
  */
  void testOrientation();
//==============================================================================
  /*!
  * \brief Определение границ триангуляции
  * \param[in] tops - вершины, на которых должна быть построена триангуляция
  */
  void triangulateArea(const std::deque<std::shared_ptr<Top>>& tops);
//==============================================================================
  /*!
  * \brief Добавление вершины в триангуляцию
  * \details Осуществляется коррекция триангуляции Делоне путем введения
  * \        в нее новой вершины.
  * \param[in] top - указатель на вершину.
  */
  void include(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Локализация: Поиск грани
  * \details Ищется грань, в которую попадает указанная вершина.
  * \param[in] top - указатель на вершину.
  * \return Указатель на грань.
  */
  std::shared_ptr<Triangle> nest(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Расчистка
  * \details Уничтожение граней, в описанную окружность которых попадает вершина,
  * \        и добавление ребер, освободившихся в результате расчистки 
  * \        в набор для штопки.
  * \param[in] tr    - указатель на грань, в котором локализована вершина.
  * \param[in] top - указатель на вершину.
  */
  void distroyNet(std::shared_ptr<Triangle> tr, std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Штопка 
  * \details Построение новых граней, из ребер, входящих в набор для штопки 
  * \        и новой вершины, а так же, возможно, из ребер, составляющих 
  * \        внешнюю границу триангуляции.
  * \param[in] top - указатель на вершину.
  */
  void recoveryNet(std::shared_ptr<Top> top);
//==============================================================================
  /*!
  * \brief Задание грани признака законченности
  * \param[in] tr - указатель на грань, для которой необходимо определить 
  * \               признак законченности.
  */
  void finitTriangle(std::shared_ptr<Triangle>& tr);
//==============================================================================
  /*!
  * \brief Очистка триангуляции
  */
  void clearTriangulation();
//==============================================================================
  /*!
  * \brief Удаление граней, построенных на вершинах триангуляции 
  */
  void clearingTriangulateArea();
//==============================================================================
  /*!
  * \brief Сопряжение или вставка ребра в список
  * \details Производится сопряжение или вставка заданного ребра в
  * \        указанный список.
  * \param[in] rb   - указатель на ребро;
  * \param[in] head - указатель на список.
  */
  void adOrPaste(std::shared_ptr<Edge>& rb, std::shared_ptr<Head>& head);
//==============================================================================
  /*!
  * \brief Быстрая сортировка списка вершин
  * \details Осуществляется быстрая сортировка списка вершин
  * \param[in] tops  - список вершин;
  * \param[in] first - начальная позиция сортировки;
  * \param[in] last  - финальная позиция сортировки.
  */
  void quickSort(std::deque<std::shared_ptr<Top>>& tops, int first, int last);
//==============================================================================
  /*!
  * \brief Сортировка массива по возрастанию значения id вершин
  * \param[in] tops  - список вершин;
  */
  void sortById(std::deque<std::shared_ptr<Top>>& tops);
//==============================================================================
  /*!
  * \brief Расчистка внутри полигона
  * \details Выполняется удаление плохих ребер и граней из триангуляции, 
  * \        попадающих внутрь полигона, заданного ребром.
  * \        Удаляются грани и ребра находящиеся слева от указанной.
  * \param[in] first - указатель на первую вершину ребра;
  * \param[in] last  - указатель на вторую вершину ребра.
  */
  void clearingIntoPolygon(std::shared_ptr<Top> first, 
                           std::shared_ptr<Top> second);
//==============================================================================
  /*!
  * \brief Поиск ребра по двум вершинам
  * \param[in] first - указатель на первую вершину ребра;
  * \param[in] last  - указатель на вторую вершину ребра.
  * \return Указатель на ребро.
  */
  std::shared_ptr<Edge> findEdge(std::shared_ptr<Top> first,
                                 std::shared_ptr<Top> second);
//==============================================================================
  /*!
  * \brief Удаление провисших рёбер (без сылок на грани)
  */
  void clearingSurplusEdges();
//==============================================================================
  /*!
  * \brief Удаление соседних граней для граней через нефиксированные рёбра
  * \param[in] listTriangles - список граней;
  */
  void clearingNearTriangles(std::shared_ptr<Head>& listTriangles);
//==============================================================================
public:
  std::shared_ptr<Head> listEdge;  //!< список ребер
  std::shared_ptr<Head> listTrian; //!< список граней
//==============================================================================
protected:
  std::shared_ptr<Head>             mHole;    //!< список элементов для штопки
  std::deque<std::shared_ptr<Top>>  mArea;    //!< границы триангуляции
  std::shared_ptr<Triangle>         mEmptyTr; //!< пустая грань
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_TRIANGULATION_DELAUNEY_HPP