#ifndef GEODESIC_HELPER_CONSTANTS_HPP
#define GEODESIC_HELPER_CONSTANTS_HPP
//==============================================================================
namespace Geodesic
{
//==============================================================================
/*!
 * \brief Перечень базовых эллипсоидов
*/
enum BasicEllipsoid
{
  EL_WGS_84        = 0, //!< эллипсоид WGS 84
  EL_KRASOVSKY     = 1, //!< эллипсоид Красовского
  EL_GENERAL_GLOBE = 2  //!< общеземной эллипсоид ПЗ.90
};
//==============================================================================
}
//==============================================================================
#endif //! GEODESIC_HELPER_CONSTANTS_HPP