#ifndef GEODESIC_HELPER_ELLIPSOID_HPP
#define GEODESIC_HELPER_ELLIPSOID_HPP
//==============================================================================
#include <Geodesic/Helper/Constants.hpp>
//! std
#include <memory>
//==============================================================================
namespace Geodesic
{
class EllipsoidInner;    //!< параметры эллипсоида
class LoxodromeTools;    //!< инструменты для работы с локсодромией
class OrthodromyTools;   //!< инструменты для работы с ортодромией
class OrthographicInner; //!< функционал ортографической проекции

/*!
 * \brief Класс Эллипсоид
*/
class Ellipsoid
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \param[in] majorRadius - большая полуось [м]
   * \param[in] flattening - полярное сжатие
  */
  Ellipsoid(double majorRadius, double flattening);
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \param[in] type - тип эллипсоида из стандартных 
  */
  Ellipsoid(BasicEllipsoid type);
//==============================================================================
  /*!
   * \brief Создание инструмента для работы с локсодромией на текущем эллипсоиде
   * \return Инструмент для работы с локсодромией на текущем эллипсоиде
  */
  std::shared_ptr<LoxodromeTools> createLoxodromeTools() const;
//==============================================================================
  /*!
   * \brief Создание инструмента для работы с ортодромией на текущем эллипсоиде
   * \return Инструмент для работы с ортодромией на текущем эллипсоиде
  */
  std::shared_ptr<OrthodromyTools> createOrthodromyTools() const;
//==============================================================================
  /*!
   * \brief Получить длину большой полуоси эллипсоида
   * \return Длина большой полуоси эллипсоида [м]
  */
  double getMajorRadius() const;
//==============================================================================
  /*!
   * \brief Получить длину малой полуоси эллипсоида
   * \return Длина малой полуоси эллипсоида [м]
  */
  double getMinorRadius() const;
//==============================================================================
  /*!
   * \brief Получить коэффициент полярного сжатия эллипсоида
   * \return Коэффициент полярного сжатия
  */
  double getFlatenning() const;
//==============================================================================
private:
//==============================================================================
  std::shared_ptr<EllipsoidInner> mParams; //!< параметры эллипсоида
//==============================================================================
  //! Обеспечение доступа к параметрам эллипсоида внутри классов
  friend class Transition;  
  friend class OrthographicInner;
//==============================================================================
};
//==============================================================================
} //! Geodesic
//==============================================================================
#endif //! GEODESIC_HELPER_ELLIPSOID_HPP