#ifndef GEODESIC_OBJECTS_DUAL_POLYGON_HPP
#define GEODESIC_OBJECTS_DUAL_POLYGON_HPP
//==============================================================================
//! PrimaryEntities
#include <PrimaryEntities/GeodesicEntities.hpp>
#include <PrimaryEntities/CircleLite.hpp>
//==============================================================================
namespace Geodesic
{
using PrimaryEntities::GeoCircleLite2D;
//==============================================================================
/*
 *\brief Двуликий полигон (окружность <-> контур) в географических координатах
 *\details Полигон одновременно хранит оба представления, а также информацию о 
 * том, которое из них первично. Первичным считается то представление, в котором
 * последний раз вводились данные (изначально созданный с помощью окружности 
 * полигон, которому позднее задали новую многоугольную границу, будет содержать
 * пересчитанную для новой границы окружность и считать себя первично
 * многоугольником)
 */

class DualPolygon
{
public:
 /*!
  *\brief Конструктор класса 
  *\details Для первичного представления в виде окружности
  *\param[in] center - центр окружности (географические координаты)
  *\param[in] radius - радиус окружности [м]
  *\param[in] numOfVertexes - число вершин в приближенном многоугольнике
  *\throws GeodesicFailure # NegativeRadius
  */
  DualPolygon( const GeoPoint2D& center, const double radius
    , const size_t numOfVertexes = 360 );
//==============================================================================
 /*!
  *\brief Конструктор класса 
  *\details Для первичного представления в виде окружности
  *\param[in] circle - окружность
  *\param[in] numOfVertexes - число вершин в приближенном многоугольнике
  *\throws GeodesicFailure # NegativeRadius
  */
  DualPolygon( const GeoCircleLite2D& circle, const size_t numOfVertexes = 360 );
//==============================================================================
 /*!
  *\brief Конструктор класса
  *\details Для первичного представления в виде многоугольника
  *\param[in] polygon - многоугольник (географические координаты) 
  *\param[in] numOfVertexes - число вершин в приближенном многоугольнике
  *           (на случай, когда полигон решит переродиться в окружность)
  *\throws GeodesicFailure # EmptyPolygon
  */
  DualPolygon( const GeoMultiPolygon2D& polygon
    , const size_t numOfVertexes = 360 );
//==============================================================================
 /*!
  *\brief Конструктор класса 
  *\details Для первичного представления в виде окружности
  *\param[in] center - центр окружности (географические координаты)
  *\param[in] radius - радиус окружности [м]
  *\param[in] chord - максимальная длина стягивающей хорды
  *\throws GeodesicFailure # NegativeRadius
  */
  DualPolygon( const GeoPoint2D& center, const double radius
    , const double chord );
//==============================================================================
 /*!
  *\brief Конструктор класса 
  *\details Для первичного представления в виде окружности
  *\param[in] circle - окружность
  *\param[in] chord - максимальная длина стягивающей хорды
  *\throws GeodesicFailure # NegativeRadius
  */
  DualPolygon( const GeoCircleLite2D& circle, const double chord );
//==============================================================================
 /*!
  *\brief Конструктор класса
  *\details Для первичного представления в виде многоугольника
  *\param[in] polygon - многоугольник (географические координаты) 
  *\param[in] chord - максимальная длина стягивающей хорды
  *           (на случай, когда полигон решит переродиться в окружность)
  *\throws GeodesicFailure # EmptyPolygon
  */
  DualPolygon( const GeoMultiPolygon2D& polygon, const double chord );
//==============================================================================
//==============================================================================
 /*!
  *\brief Получение центра полигона
  *\return центр (географическая точка)
  */
  inline const GeoPoint2D& getCenter( ) const
  {
    return mCircle.center;
  }
//==============================================================================
 /*!
  *\brief Задание центра полигона (для представления окружностью)
  *\param[in] center - центр (географическая точка)
  */
  void setCenter( const GeoPoint2D& center );
//==============================================================================
 /*!
  *\brief Получение радиуса полигона
  *\return радиус [м]
  */
  inline double getRadius( ) const
  {
    return mCircle.radius;
  }
//==============================================================================
 /*!
  *\brief Задание радиуса полигона (для представления окружностью)
  *\param[in] radius - радиус [м]
  *\throws GeodesicFailure # NegativeRadius
  */
  void setRadius( const double radius );
//==============================================================================
 /*!
  *\brief Получение полигона как окружности
  *\return окружность
  */
  inline const GeoCircleLite2D& getCircle( ) const
  {
    return mCircle;
  }
//==============================================================================
 /*!
  *\brief Задание полигона как окружности 
  *\param[in] circle - окружность
  *\throws GeodesicFailure # NegativeRadius
  */
  void setCircle( const GeoCircleLite2D& circle );
//==============================================================================
 /*!
  *\brief Получение полигона как многоугольника
  *\return полигон
  */
  inline const GeoMultiPolygon2D& getPolygon( ) const
  {
    return mPolygon;
  }
//==============================================================================
 /*!
  *\brief Задание полигона как многоугольника
  *\param[in] polygon - задаваемый полигон
  *\throws GeodesicFailure # EmptyPolygon
  */
  void setPolygon( const GeoMultiPolygon2D& polygon );
//==============================================================================
 /*!
  *\brief Получение точности представления круглого полигона в виде многоугольника
  *\return точность представления круглого полигона в виде многоугольника
  */
  inline size_t getNumOfVertexes( ) const
  {
    return mNumOfVertexes;
  }
//==============================================================================
 /*!
  *\brief Задание точности представления круглого полигона в виде многоугольника
  *\param[in] num - число вершин в многоугольном представлении
  */
  void setNumOfVertexes( const size_t num );
//==============================================================================
 /*!
  *\brief Задание точности представления круглого полигона в виде многоугольника
  *\param[in] chord - максимальная длина стягивающей хорды
  */
  void setLenOfChord( const double chord );
//==============================================================================
 /*!
  *\brief Был ли полигон изначально построен как окружность
  *\return true - полигон создавался как окружность
  *       false - полигон создавался как многоугольник
  */
  inline bool isOriginallyCircle( ) const
  {
    return mIsOriginallyCircle;
  }
//==============================================================================
/*!
 *\brief Построить прямоугольник, содержащий точки полигона (возможно, с запасом)
 *\details Для полигонов, изначально заданных как окружность, построение будет по 
 *         центру и радиусу. Для прочих - по всем точкам границы.
 *         Стороны полученного прямоугольника параллельны осям координат
 *\param[in] buffer - отступ, на который треуется увеличить box [м]
 *\return построенный box
 */
  GeoPolygon2D box( const double buffer = 0 ) const;
//==============================================================================
protected:
//==============================================================================
 /*!
  *\brief Построить по окружности многоугольник
  */
  virtual void buildPolygon( );
//==============================================================================
 /*!
  *\brief Построить по многоугольнику окружность
  */
  virtual void buildCircle( );
//==============================================================================
  //TODO: вероятно, здесь же должен быть вариант покрытия кругами с заданными
  //      параметрами точности
//==============================================================================
protected:
//==============================================================================
  // характеристики представления в виде круга
  GeoCircleLite2D    mCircle;

  // характеристики представления в виде многоугольника
  GeoMultiPolygon2D mPolygon;

  // какое из представлений первично
  bool              mIsOriginallyCircle; // изначально задан кругом?

  // параметры преобразований
  size_t            mNumOfVertexes; // число вершин многоугольника, представляющего окружность
  double            mChordMaxLength; // максимальная длина стягивающей хорды
  bool              mWithVertexesNum; // использовать при определении точности число вершин
};
//==============================================================================
typedef std::shared_ptr<DualPolygon> DualisticPolyPtr;
//==============================================================================
} // ! Geodesic
//==============================================================================
#endif // ! GEODESIC_OBJECTS_DUAL_POLYGON_HPP
