#ifndef GEODESIC_HELPER_ELLIPSOID_INNER_HPP
#define GEODESIC_HELPER_ELLIPSOID_INNER_HPP
//==============================================================================
//! std
#include <cmath>
//==============================================================================
namespace Geodesic
{
/*!
 * \brief Класс параметров эллипсоида
 * Вычисление всех необходимых параметров один раз при создании эллипсоида
*/
class EllipsoidInner
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \param[in] majorRadius - большая полуось [м]
   * \param[in] flattening - полярное сжатие
  */
  EllipsoidInner(double majorRadius, double flattening)
  : a       (majorRadius)
  , f       (flattening)
  , b       (a * (1. - f))
  , ee      (f * (2. - f))
  , ree     (1. / ee)
  , e       (sqrt(ee))
  , aDEVe   (a / e)
  , aa      (a * a)
  , aaDEVbb (aa / (b * b))
  , aee     (a * ee)
  {}
//==============================================================================
  const double a;       //!< большая полуось [м]
  const double f;       //!< полярное сжатие
  const double b;       //!< малая полуось [м]
  const double ee;      //!< квадрат первого эксцентриситета (e ^ 2)
  const double ree;     //!< величина обратная квадрату первого эксцентриситета 
                        //!  (1 / e ^ 2)
  const double e;       //!< первый эксцентриситет
  const double aDEVe;   //!< соотношение большей полуоси и первого эксцентриситета
                        //!  (a / e)
  const double aa;      //!< квадрат большей полуоси (a ^ 2)
  const double aaDEVbb; //!< соотношение квадратов большой и малой полуоси 
                        //!  (a ^ 2 / b ^ 2)
  const double aee;     //!< произведение большей полуоси на квадрат первого 
                        //!  эксцентриситета (a * e ^ 2)
//==============================================================================
};
//==============================================================================
} //! Geodesic
//==============================================================================
#endif //! GEODESIC_HELPER_ELLIPSOID_INNER_HPP