#ifndef GEODESIC_GEOLINETOOLS_HELPER_LOXODROME_HPP
#define GEODESIC_GEOLINETOOLS_HELPER_LOXODROME_HPP
//==============================================================================
#include <Geodesic/GeoLineTools/Inner/GeodesicLine.hpp>
//! Point
#include <Point/GeoPoint2D.hpp>
//! std
#include <memory>
//==============================================================================
namespace GeographicLib
{
  class RhumbLine;
}
//==============================================================================
namespace Geodesic
{
//==============================================================================
/*!
 * \brief Класс Локсодромия
*/
class Loxodrome : public Inner::GeodesicLine
{
//==============================================================================
public:
//==============================================================================
  /*!
   * Функционал унаследованный от GeodesicLine:
   * - divide             - разбиение на равные сегменты
   * - getStartPoint      - точка начала
   * - getFinishPoint     - точка завершения
   * - getDistance        - протяжённость
   * - getAzimuthAtStart  - азимут из точки начала    
   * - getAzimuthAtFinish - азимут из точки завершения
   *
   * Локсодромия сохраняет углы, поэтому азимуты из точки начала и завершения 
   * равны.
  */
//==============================================================================
  /*!
   * \brief Получение координаты точки, отстоящей от начальной точки локсодромии
   *        на заданное расстоение
   * \details НЕ РАБОТАЕТ НА ПОЛЮСЕ И ЧЕРЕЗ ПОЛЮС!
   *          Если локсодромия до искомой точки пересечёт полюс или локсодромия
   *          некорректна, тогда долгота искомой точки приравнивается к NAN.
   *          
   * \param[in] distance - расстояние от начальной точки по локсодромии [м]
   * \return Координаты точки
  */ 
  GeoPoint2D pointPosition(double distance) const noexcept override;
//==============================================================================
  /*!
   * \brief Получение координаты точки, отстоящей от начальной точки локсодромии
   *        на заданное расстоение
   * \details НЕ РАБОТАЕТ НА ПОЛЮСЕ И ЧЕРЕЗ ПОЛЮС!
   *          Если локсодромия до искомой точки пересечёт полюс или локсодромия
   *          некорректна, тогда долгота искомой точки приравнивается к NAN.
   *
   * \param[in] distance - расстояние от начальной точки по локсодромии [м]
   * \param[out] newAzimuth - азимут новой точки.
   * \return Координаты точки
   */
  inline GeoPoint2D
  pointPosition(double distance, Radian& newAzimuth) const noexcept override
  {
    newAzimuth = mStartAzimuth;
    return pointPosition(distance);
  }
//==============================================================================
private:
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \details Локсодромия может быть создана только при помощи класса 
   *          LoxodromeTools
  */
  Loxodrome();
//==============================================================================
  //! Локсодромия (линия - как луч, от точки начала в заданном направлении)
  std::shared_ptr<GeographicLib::RhumbLine> mLine; 
//==============================================================================
  //! Обеспечение доступа к параметрам локсодромии внутри классов
  friend class LoxodromeTools;  
//==============================================================================
};
//==============================================================================
} //! Geodesic
//==============================================================================
#endif //! GEODESIC_GEOLINETOOLS_HELPER_LOXODROME_HPP