#ifndef GEODESIC_GEOLINETOOLS_HELPER_ORTHODROMY_HPP
#define GEODESIC_GEOLINETOOLS_HELPER_ORTHODROMY_HPP
//==============================================================================
#include <Geodesic/GeoLineTools/Inner/GeodesicLine.hpp>
//! Point
#include <Point/GeoPoint2D.hpp>
//! std
#include <memory>
//==============================================================================
namespace GeographicLib
{
  class GeodesicLine;
}
//==============================================================================
namespace Geodesic
{
/*!
* \brief Класс Ортодромия
*/
class Orthodromy : public Inner::GeodesicLine
{
//==============================================================================
public:
//==============================================================================
  /*!
   * Функционал унаследованный от GeodesicLine:
   * - divide             - разбиение на равные сегменты
   * - getStartPoint      - точка начала
   * - getFinishPoint     - точка завершения
   * - getLength          - протяжённость
   * - getAzimuthAtStart  - азимут из точки начала
   * - getAzimuthAtFinish - азимут из точки завершения
  */
//==============================================================================
  /*!
   * \brief Получение координаты точки, отстоящей от начальной точки ортодромии
   *        на заданное число метров.
   * \param[in] distance - величина сдвига от начальной точки по ортодромии [м]
   * \return Координаты точки
   */ 
  GeoPoint2D pointPosition(double distance) const noexcept override;
//==============================================================================
  /*!
   * \brief Получение координаты точки, отстоящей от начальной точки ортодромии
   *        на заданное число метров.
   * \param[in] distance - величина сдвига от начальной точки по ортодромии [м]
   * \param[out] newAzimuth - азимут новой точки.
   * \return Координаты точки
   */
  GeoPoint2D
  pointPosition(double distance, Radian& newAzimuth) const noexcept override;
//==============================================================================
private:
//==============================================================================
  /*!
   * \brief Конструктор класса
   * \details Ортодромия может быть создана только при помощи класса 
   *          OrthodromyTools
  */
  Orthodromy();
//==============================================================================
  //! Ортодромия (линия - как луч, от точки начала в заданном направлении)
  std::shared_ptr<GeographicLib::GeodesicLine> mLine;
//==============================================================================
  //! Обеспечение доступа к параметрам ортодромии внутри классов
  friend class OrthodromyTools;
//==============================================================================
};
//==============================================================================
} //! Geodesic
//==============================================================================
#endif //! GEODESIC_GEOLINETOOLS_HELPER_ORTHODROMY_HPP