#ifndef TRIANGULAR_GEOMETRY_PATHFINDER_PATHHANDLER_HPP
#define TRIANGULAR_GEOMETRY_PATHFINDER_PATHHANDLER_HPP
//==============================================================================
//! std
#include <memory>
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class Head;
class Knot;
class Top;
class Triangle;
//==============================================================================
  /*!
   * \brief Обработчик маршрута
   * \details Используется для последовательной обработки ключевых
   *          узлов маршрута. При этом для каждого узла ищется зона
   *          обзора, пока не будет найден маршрут до конечной точки
   *          (из всех найденных маршрутов выбирается кратчайший).
   */
class PathHandler : public std::enable_shared_from_this<PathHandler>
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор
   *
   * \details Инициализация пустой очереди ключевых узлов.
   */
  PathHandler();
//==============================================================================
  /*!
   * \brief Деструктор
   *
   * \details Очистка очереди ключевых узлов.
   */
  ~PathHandler();
//==============================================================================
  /*!
   * \brief Запуск обработчика маршрута
   *
   * \details Производится поиск маршрута от начальной вершины до
   *          конечной, локализованных в соответствующих гранях.
   *
   * \param[in] startTop - указатель на начальную вершину;
   *
   * \param[in|out] finishTop - указатель на конечную вершину (если путь
   *                            найден, обновится информация о дальности и
   *                            предыдущей вершине);
   *
   * \param[in] startTriangle - указатель на начальную грань;
   *
   * \param[in] finishTriangle - указатель на конечную грань.
   */
  void scanPathGraph(
    std::shared_ptr<Top> startTop,
    std::shared_ptr<Top> finishTop,
    std::shared_ptr<Triangle> startTriangle,
    std::shared_ptr<Triangle> finishTriangle);
//==============================================================================
  /*!
   * \brief Добавление ключевого узла в очередь
   *
   * \details Производится добавление ключевого узла в очередь с
   *          последующим переупорядочиванием очереди, для
   *          последовательной обработки узлов маршрута.
   *
   * \param[in] knot - указатель на ключевой узел.
   */
  void setKnot(std::shared_ptr<Knot> knot);
//==============================================================================
private:
//==============================================================================
  std::shared_ptr<Head> mKnotsList; //!< Очередь ключевых узлов
  std::shared_ptr<Knot> mCurKnot; //!< Текущий ключевой узел из очереди
//==============================================================================
};
//==============================================================================
} // !TriangularGeometry
  //==============================================================================
#endif //! TRIANGULAR_GEOMETRY_PATHFINDER_PATHHANDLER_HPP