#ifndef TRIANGULAR_GEOMETRY_PATHFINDER_VISIBLEPATH_HPP
#define TRIANGULAR_GEOMETRY_PATHFINDER_VISIBLEPATH_HPP
//==============================================================================
//! PathFinder
#include "PathFinder/Knot.hpp"
//==============================================================================
namespace TriangularGeometry
{
//==============================================================================
class PathHandler;
//==============================================================================
  /*!
   * \brief Класс построения зоны обзора из заданной вершины
   *        через заданное выходное ребро
   */
class VisiblePath : public Link
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор
   *
   * \param[in] localStartKnot - указатель на текущий стартовый узел, с
   *                             которого начинается поиск области
   *                             видимости;
   *
   * \param[in] exitEdge - указатель на ребро, через которое начинается
   *                       движение по маршруту;
   *
   * \param[in] localTriangle - указатель на начальную грань текущего
   *                            участка маршрута;
   *
   * \param[in] finishTriangle - указатель на конечную грань всего
   *                             маршрута.
   */
  VisiblePath(
    std::shared_ptr<Knot> localStartKnot,
    std::shared_ptr<Triangle> localTriangle,
    std::shared_ptr<Edge> exitEdge,
    std::shared_ptr<Triangle> finishTriangle);
//==============================================================================
  /*!
   * \brief Копирующий конструктор
   *
   * \param[in] visiblePath - указатель на копируемый объект.
   */
  VisiblePath(std::shared_ptr<VisiblePath> visiblePath);
//==============================================================================
  /*!
   * \brief Построение зоны обзора от текущей начальной вершины.
   *
   * \details Построение зоны обзора от текущей начальной вершины
   *          в направлении конечной вершины маршрута через заданное
   *          выходное ребро. Для найденных последних в области
   *          видимости узлов соответствующие задачи будут добавлены
   *          в очередь заданий, и построение зоны обзора от них будет
   *          проводиться отдельно.
   *
   * \param[in|out] finishTop - указатель на конечную вершину полного пути
   *                            (если путь найден, обновится информация о
   *                            дальности и предыдущей вершине);
   *
   * \param[in|out] pathHandler - указатель на обработчик маршрута (в него
   *                              будут добавлены промежуточные узлы, от
   *                              которых нужно будет прокладывать маршрут);
   */
  void findLastVisibleKnot(
    std::shared_ptr<Top> finishTop,
    std::shared_ptr<PathHandler> pathHandler);
//==============================================================================
private:
//==============================================================================
  /*!
   * \brief Определение положения вершины относительно зоны видимости
   *        текущей стартовой вершины.
   *
   * \details Текущая зона обзора задаётся лучами, исходящими из
   *          текущей стартовой вершины в направлении вершин
   *          текущего выходного ребра.
   *
   * \param[in] top - указатель на вершину, положение которой
   *                  определяется;
   *
   * \return Положение вершины.
   */
  Geometry::PlanePosition locationInVisibleZone(std::shared_ptr<Top> top);
//==============================================================================
  std::shared_ptr<Knot>     mLocalStartKnot; //!< Текущий стартовый узел
  std::shared_ptr<Top>      mLocalStartTop;  //!< Текущая стартовая вершина
                                             //!< (соответствует
                                             //!< mLocalStartKnot)

  std::shared_ptr<Triangle> mLocalTriangle; //!< Грань, относительно
                                            //!< которой ищем продолжение
                                            //!< маршрута

  std::shared_ptr<Edge>     mCurExitEdge; //!< Текущее выходное ребро


  std::shared_ptr<Top>      mLeftTop;   //!< Левый створ зоны обзора
  std::shared_ptr<Top>      mRightTop;  //!< Правый створ зоны обзора

  std::shared_ptr<Triangle> mFinishTriangle; //!< Указатель на конечную
                                             //!< грань маршрута
//==============================================================================
};
//==============================================================================
} // !TriangularGeometry
//==============================================================================
#endif //! TRIANGULAR_GEOMETRY_PATHFINDER_VISIBLEPATH_HPP