#ifndef POINT_POINT2D_HPP
#define POINT_POINT2D_HPP
//==============================================================================
#include <cstddef>
#include <utility>
//! MathTools
#include <MathTools/BasicMath/Compare.hpp>
//! Geos
#include <geos/geom/Coordinate.h>
#include <geos/geom/GeometryFactory.h>
//==============================================================================
/*!
 * \brief Точка в двумерном евклидовом пространстве
 */
class Point2D
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса через два параметра (координаты)
   * \param[in] x - значение координаты по оси OX
   * \param[in] y - значение координаты по оси OY
   */
  Point2D(const double x = 0., const double y = 0.)
    : mPoint(x, y)
  {}
//==============================================================================
  /*!
   * \brief Копирующий конструктор
   * \param[in] point - копируемая точка
   */
  Point2D(const Point2D& point)
    : mPoint(point.mPoint)
  {}
//==============================================================================
  /*!
   * \brief Получение координат точки
   * \return Координаты точки
   */
  inline std::pair<double, double> get() const
  {
    return { mPoint.x, mPoint.y };
  }
//==============================================================================
  /*!
   * \brief Получение координаты точки по оси OX
   * \return Координата по OX
   */
  inline double getX() const
  {
    return mPoint.x;
  }
//==============================================================================
  /*!
   * \brief Получение координаты точки по оси OY
   * \return Координата по OY
   */
  inline double getY() const
  {
    return mPoint.y;
  }
//==============================================================================
  /*!
   * \brief Задание новых координат точки
   * \param[in] x - значение по оси OX
   * \param[in] y - значение по оси OY
   */
  inline void set(const double x, const double y)
  {
    mPoint.x = x;
    mPoint.y = y;
  }
//==============================================================================
  /*!
   * \brief Сравнение двух точек
   * \param[in] point - точка, с которой сравниваем текущую
   * \return true  - совпадают
   *         false - не совпадают
   */
  inline bool operator == (const Point2D& point) const
  {
    return (BasicMath::isEqual(getX(), point.getX())
         && BasicMath::isEqual(getY(), point.getY()));
  }
//==============================================================================
  /*
   * \brief Сравнение двух точек на неравенство
   * \param[in] point - точка, с которой сравниваем текущую
   * \return true  - не совпадают
   *         false - совпадают
   */
  inline bool operator != (const Point2D& point) const
  {
    return !(*this == point);
  }
//==============================================================================
  /*
   * \brief Деструктор
   */
  virtual ~Point2D() {}
//==============================================================================
private:
//==============================================================================
  geos::geom::CoordinateXY mPoint; //!< координаты точки в двумерном евклидовом
                                   //!  пространстве: (x, y).
//==============================================================================
public:
//==============================================================================
  /* 
   * \brief Фиктивная функция нормализации
   */
  inline void normalize(size_t fictiveParam = 1)
  {}
//==============================================================================
  /*!
   * \brief Получение geos-координат точки
   * \details [!] Только для внутренних алгоритмов
   * \return Координаты точки
   */
  inline geos::geom::CoordinateXY getCoordinates() const
  {
    return mPoint;
  }
//==============================================================================
};
//==============================================================================
#endif //! POINT_POINT2D_HPP