#ifndef POINT_POINT3D_HPP
#define POINT_POINT3D_HPP
//==============================================================================
//! MathTools
#include <MathTools/BasicMath/Compare.hpp>
//! std
#include <tuple>
//! Geos
#include <geos/geom/Coordinate.h>
#include <geos/geom/GeometryFactory.h>
//==============================================================================
/*!
 * \brief Точка в трехмерном евклидовом пространстве
 */
class Point3D
{
//==============================================================================
public:
//==============================================================================
  /*!
   * \brief Конструктор класса через три параметра (коордианты)
   * \param[in] x - значение координаты по оси OX
   * \param[in] y - значение координаты по оси OY
   * \param[in] z - значение координаты по оси OZ
   */
  Point3D(const double x = 0., const double y = 0., const double z = 0.)
    : mPoint(x, y, z)
  {}
//==============================================================================
  /*!
   * \brief Копирующий конструктор
   * \param[in] point - копируемая точка
   */
  Point3D(const Point3D& point)
    : mPoint(point.mPoint)
  {}
//==============================================================================
  /*!
   * \brief Получение координат точки
   * \return Координаты точки
   */
  inline std::tuple<double, double, double> get() const
  {
    return { mPoint.x,  mPoint.y,  mPoint.z };
  }
//==============================================================================
  /*!
   * \brief Получение координаты точки по оси OX
   * \return Координата по OX
   */
  inline double getX() const
  {
    return mPoint.x;
  }
//==============================================================================
  /*!
   * \brief Получение координаты точки по оси OY
   * \return Координата по OY
   */
  inline double getY() const
  {
    return mPoint.y;
  }
//==============================================================================
  /*!
   * \brief Получение координаты точки по оси OZ
   * \return Координата по OZ
   */
  inline double getZ() const
  {
    return mPoint.z;
  }
//==============================================================================
  /*!
   * \brief Задание новых координат точки
   * \param[in] x - значение по оси OX
   * \param[in] y - значение по оси OY
   * \param[in] z - значение координаты по оси OZ
   */
  inline void set(const double x, const double y, const double z)
  {
    mPoint.x = x;
    mPoint.y = y;
    mPoint.z = z;
  }
//==============================================================================
  /*!
   * \brief Сравнение двух точек
   * \param[in] point - точка, с которой сравниваем текущую
   * \return true  - совпадают
   *         false - не совпадают
   */
  inline bool operator == (const Point3D& point) const
  {
    return (BasicMath::isEqual(getX(), point.getX())
         && BasicMath::isEqual(getY(), point.getY())
         && BasicMath::isEqual(getZ(), point.getZ()));
  }
//==============================================================================
  /*
   * \brief Сравнение двух точек на неравенство
   * \param[in] point - точка, с которой сравниваем текущую
   * \return true  - не совпадают
   *         false - совпадают
   */
  inline bool operator != (const Point3D& point) const
  {
    return !(*this == point);
  }
//==============================================================================
  /*
   * \brief Деструктор
   */
  virtual ~Point3D() {}
//==============================================================================
private:
//==============================================================================
  geos::geom::Coordinate mPoint; //!< координаты точки в трёхмерном
                                 //!  евклидовом пространстве: (x, y, z).
//==============================================================================
public:
//==============================================================================
  /* 
   * \brief Фиктивная функция нормализации
   */
  inline void normalize(size_t fictiveParam = 1)
  {}
//==============================================================================
  /*!
   * \brief Получение geos-координат точки
   * \details [!] Только для внутренних алгоритмов
   * \return Координаты точки
   */
  inline geos::geom::Coordinate getCoordinates() const
  {
    return mPoint;
  }
//==============================================================================
};
//==============================================================================
#endif //! POINT_POINT3D_HPP