#ifndef IO_EXCEPTIONS_HPP
#define IO_EXCEPTIONS_HPP
//==============================================================================
//! ExceptionTools
#include <ExceptionTools/ExceptionTools.hpp>
//==============================================================================
using namespace ExceptionTools;
//==============================================================================
//! Название библиотеки для исключений
const std::string IO_LIB_TITLE = "IOTools";
//==============================================================================
/*!
 * \brief Класс формирования исключений библиотеки Route
 */
class IOFailure : public ExceptionTools::Failure
{
//==============================================================================
public:
  /*!
   * \brief Создание исключения.
   * \details Требуется код, остальные параметры подставятся автоматически
   * \param[in] failureId - именованный код исключения
   * \param[in] postfix - текст уточняющий/дополняющий исключение
   *                      (может использоваться для передачи текста исходного
   *                       исключения)
   * \param[in] prefix - текст, локализующий место возникновения исключения
   *                     (может использоваться для указания имени функции,
   *                      в которой локализовано исключение - трассировка
   *                      исключения)
   */
  explicit IOFailure(const unsigned int failureId,
    const std::string& postfix = "",
    const std::string& prefix = "") noexcept;
};
//==============================================================================
#endif //! IO_EXCEPTIONS_HPP